{"id": "ROOT", "speaker": "phpnode", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2018-08-29T17:08:04Z", "text": "Bump major version before releasing license change. A polite and hopefully unnecessary reminder that when the license change is released it should be a major version bump. I'm imagining the fall out that would occur if this were released as a patch version and it wouldn't be pretty. \r \r > Note: Arguments for / against the license change are happening in other issues, let's please keep them out of this one.\r ", "meta": {"posReactions": "37", "negReactions": "0"}}
{"id": "COM0", "speaker": "jamiebuilds", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2018-08-29T18:07:59Z", "text": "maybe", "meta": {"posReactions": "0", "negReactions": "68"}}
{"id": "COM1", "speaker": "hallister", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2018-08-29T18:11:25Z", "text": "You're going to introduce a major license change, refuse to change the license name and do it in a minor version bump? What the actual hell is your goal here? ", "meta": {"posReactions": "19", "negReactions": "0"}}
{"id": "COM2", "speaker": "jamiebuilds", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2018-08-29T18:17:02Z", "text": "To screw with companies that support ICE, was that not clear?", "meta": {"posReactions": "3", "negReactions": "72"}}
{"id": "COM3", "speaker": "hallister", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2018-08-29T18:27:50Z", "text": "By releasing a major license change as a minor version bump and using an incorrect license in the license field? You're screwing Lerna, not the companies listed. Ignoring you politicizing something that has no business being political (especially as a former Facebook employee... come on), literally every company listed is going to update their packages to pull from https://github.com/LernaOpenSource/LernaOpenSource and go back to work. Meanwhile you're getting massive community backlash that's only going to continue if you decide to be a child and inappropriately release this as a minor version bump or with the MIT license.\r\n\r\nThe best thing feasible for Lerna at this point is you leaving the project. But since that's not going to happen since you apparently enjoy your soap box, the second best thing is everyone moving to a fork of the project without a politician having any control. \r\n\r\nThe irony is I 100% agree with your politics, but this is not the place to express them. ", "meta": {"posReactions": "61", "negReactions": "0"}}
{"id": "COM4", "speaker": "phpnode", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2018-08-29T18:28:29Z", "text": "@jamiebuilds i would personally appreciate some certainty around this, because if you're likely to release this under a patch version I now need to go through all my clients' repos to make sure they're using lock files, fixed versions or a fork. Not because my clients are Microsoft et al but because they have contractually approved lists of licenses that we can use and this license will not qualify. \r\n\r\n> To screw with companies that support ICE, was that not clear?\r\n\r\nThe intent is pretty clear, but the unfortunate side effect is that it also screws with many developers who use this tool. I know this wasn't your intention but it sucks if I have to spend my evening checking a bunch of old repos because you'll _maybe_ release this as a patch. ", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM5", "speaker": "jamiebuilds", "conversation_id": "ROOT", "reply_to": "COM4", "timestamp": "2018-08-29T18:32:44Z", "text": "> The best thing feasible for Lerna at this point is you leaving the project.\r\n\r\nI left the Lerna project a long time ago, I've gone as far as to replace Lerna with a new tool called Bolt.\r\n\r\n> The irony is I 100% agree with your politics, but this is not the place to express them.\r\n\r\nAll technology is political, open source is especially political. It would not exist if not for political reasons. Open sourcing something is in itself a political act.\r\n\r\n> I know this wasn't your intention but it sucks if I have to spend my evening checking a bunch of old repos because you'll maybe release this as a patch.\r\n\r\nWe'll release it as major\r\n\r\n\r\n\r\n", "meta": {"posReactions": "0", "negReactions": "9"}}
{"id": "COM6", "speaker": "jamiebuilds", "conversation_id": "ROOT", "reply_to": "COM5", "timestamp": "2018-08-29T18:34:26Z", "text": "> especially as a former Facebook employee... come on\r\n\r\nOnce upon a time I thought I had to go work for those big corporations that I hate in order to do the kind of open source work I want to do. That turned out to be incredibly false. So I fucked off and told them to eat shit.", "meta": {"posReactions": "2", "negReactions": "40"}}
{"id": "COM7", "speaker": "siziyman", "conversation_id": "ROOT", "reply_to": "COM6", "timestamp": "2018-08-29T18:38:57Z", "text": "> I left the Lerna project a long time ago, \r\n\r\nAs long as you're maintaining the repository and represent it in the face of other contributors and open source community members - no, you did not. Maintainer is a part of a project.", "meta": {"posReactions": "2", "negReactions": "0"}}
{"id": "COM8", "speaker": "jamiebuilds", "conversation_id": "ROOT", "reply_to": "COM7", "timestamp": "2018-08-29T18:39:58Z", "text": "Cool story", "meta": {"posReactions": "0", "negReactions": "63"}}
