{"id": "ROOT", "speaker": "donny-dont", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2016-09-28T18:32:48Z", "text": "Support Web Components v1 The `dart:html` library should deprecate the current v0 specifications of Custom Elements and Shadow DOM and move to using v1 of both specifications. ", "meta": {"posReactions": "21", "negReactions": "0"}}
{"id": "COM0", "speaker": "donny-dont", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2016-09-28T19:20:54Z", "text": "DDC related issue https://github.com/dart-lang/sdk/issues/27311\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM1", "speaker": "donny-dont", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2016-10-17T20:46:29Z", "text": "@floitschG anything to follow for this? Chrome 54 shipped and comes with the v1 specs enabled.\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM2", "speaker": "kevmoo", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2016-11-24T00:50:12Z", "text": "@donny-dont there are a *LOT* of things we need to fixup in `dart:html` – we're holding off until DDC is locked and loaded. It'll be *much* easier to get everything working when our dev story is 100% javascript.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM3", "speaker": "kulshekhar", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2016-11-24T07:10:36Z", "text": "> when our dev story is 100% javascript\r\n\r\nI'm not sure I understand this. Could you please add some more info. Is it JS compatibility you're referring to or the possible inclusion of javascript specific tools in the build step, along with DDC?", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM4", "speaker": "zoechi", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2016-11-24T07:27:01Z", "text": "@kulshekhar the problem is the Dart VM in Dartium where during development some Dart code is directly executed by the Dart VM  but other stuff runs in JS land. \r\nWith Bazel and DDC they are working on building a developer story with fast edit-reload cycles with standard Chrome (without a Dart VM being involved) to simplify interop between the Dart code (transpiled to JS) and the native JS world.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM5", "speaker": "kulshekhar", "conversation_id": "ROOT", "reply_to": "COM4", "timestamp": "2016-11-24T07:28:13Z", "text": "Thanks @zoechi \r\n\r\nThat makes sense now :sweat_smile: ", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM6", "speaker": "eukreign", "conversation_id": "ROOT", "reply_to": "COM5", "timestamp": "2017-08-22T04:17:38Z", "text": "Any updates on this, we're in 2017 now :-D", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM7", "speaker": "matanlurey", "conversation_id": "ROOT", "reply_to": "COM6", "timestamp": "2017-08-22T04:29:38Z", "text": "I imagine there won't be any progress on this until Dart 2.0 rolls out completely removing Dartium.\r\n\r\nI'd check back in a few more months, or use JS interop to \"build your own\":\r\nhttps://pub.dartlang.org/packages/html5", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM8", "speaker": "eukreign", "conversation_id": "ROOT", "reply_to": "COM7", "timestamp": "2018-02-19T02:11:48Z", "text": "Who's still following this issue in 2018? Sorry, couldn't resist. Maybe 2018 will be the year Dart finally gets Web Components v1!", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM9", "speaker": "kevmoo", "conversation_id": "ROOT", "reply_to": "COM8", "timestamp": "2018-03-01T18:17:32Z", "text": "We're in the process of updating our `dart:html` APIs – https://dart-review.googlesource.com/c/sdk/+/24501\r\n\r\nThat roll – and getting rid of Dartium – should make it easier to support the latest Browser features.\r\n\r\nHaving said that, our primary framework – AngularDart – is not using WebComponent features, so it's not a big priority for us.\r\n\r\nMy suggestion: once we've updated `dart:html` and friends, let us know specific APIs that are missing/broken\r\n\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM10", "speaker": "elmcrest", "conversation_id": "ROOT", "reply_to": "COM9", "timestamp": "2018-03-11T10:42:24Z", "text": "That's really sad.\r\nIn my mind a serious \"community centered\" effort should kind of use and depend on different independent blocks. to make the idea more clear, `AngularDart` for sure needs some stuff handling DOM and it seems sane to me to use something like `dart:html` as a basis.\r\nso, every work from google would be contributed back to the basis and others building on top of this basis would automatically benefit - somehow like the whole OpenSource-Idea, no? ;) \r\n\r\ncurrently ` Dart` is more like: \"You want to do web? Sure, use AngularDart.\" (Hint: AngularDart != \"the web\")\r\n\r\nthat said, I'm not the guy who can actually judge what you're doing and why - just saying this from a rather distant and abstract point of view and trying to support `Dartlang` itself against common attacks. (you know those.... \"meh, google is going to throw it away anyways...\" etc.)\r\n\r\nMaybe I should add, that webComponents are the reason why our app is only running on Chrome...", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM11", "speaker": "matanlurey", "conversation_id": "ROOT", "reply_to": "COM10", "timestamp": "2018-03-11T18:43:56Z", "text": "@elmcrest Hi Marius.\r\n\r\nI realize and understand you are disappointed. I'm one of the TLs of AngularDart, and let me make it clear I think web components are awesome, and would love Dart to support them well. The primary take away here is _well_ though, and that will take a little bit of effort, because the current HTML libraries and browser bindings aren't well suited for this.\r\n\r\nWe could probably get some _hacky_ support quicker, but it won't be something useful to most customers. It's something we'd like to revisit after Dart2 launches, but until then - again to be very honest - it's just not a priority. We care, but we have limited time and resources, and have to use them efficiently, like I'm sure you do on your project(s) and company.\r\n\r\nFWIW, most popular web frameworks are not utilizing web components today:\r\n* React\r\n* Vue\r\n* Angular (JS/TS/Dart)\r\n\r\n... so it's not clear web components is the \"killer\" feature for most people.\r\n\r\nThanks for your patience!", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM12", "speaker": "eukreign", "conversation_id": "ROOT", "reply_to": "COM11", "timestamp": "2018-03-11T19:15:36Z", "text": "The *entire* point of Web Components is that it's a \"framework\" that is built-in to browsers. You can just use it, without any extra libs or 3rd party frameworks.\r\n\r\nAngularDart emulates many features of Web Components, why does it do that instead of just using Web Components directly?", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM13", "speaker": "matanlurey", "conversation_id": "ROOT", "reply_to": "COM12", "timestamp": "2018-03-11T19:24:44Z", "text": "@eukreign:\r\n\r\n> The entire point of Web Components is that it's a \"framework\" that is built-in to browsers\r\n\r\nWell, sort of. It has [yet to be supported in Microsoft Edge](https://caniuse.com/#feat=custom-elementsv1), for example, which is quite a large market segment still, and the polyfill performs quite badly. So until it works everywhere, it's not free.\r\n\r\n> AngularDart emulates many features of Web Components, why does it do that instead of just using Web Components directly\r\n\r\nAngularDart (and JS/TS, and React, and Vue, and Ember) all were created before web components were a thing. A lot of these framework authors have evaluated web components and found them severely lacking. Here is [one of the leads of React](https://docs.google.com/document/d/1QZxArgMwidgCrAbuSikcB2iBxkffH6w0YB0C1qCsuH0/edit), arguably the most popular framework today:\r\n\r\n> We’re not going to use it at all at Facebook. We’re not going to build React on it because there’s a strong model difference – imperative in Web Components to declarative in React. Web Components doesn’t have an idiomatic way to define things like where events go. How do you pass data when everything is a string? We see it more as an interop layer that lets various frameworks talk to each other.\r\n> \r\n> In talking to the Atom team, this doesn’t solve different framework idioms as it doesn’t have an opinion on how they relate.\r\n\r\nAgain, it's not that support will never be offered, but it's unlikely to happen in any immediate time frame. There are other APIs that are more useful for our users, like web workers, service workers, and more right now.\r\n\r\nFrom a _personal_ perspective (not the Dart team's), I'd use JavaScript or TypeScript if I was highly interested in web components - its much better suited for this lightweight model than Dart is (more suited for larger web applications, not scripts/standalone components/buttons).\r\n\r\nThanks for understanding!\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM14", "speaker": "eukreign", "conversation_id": "ROOT", "reply_to": "COM13", "timestamp": "2018-03-11T21:39:46Z", "text": "_This post has been deleted for violating the [code of conduct][]._\r\n\r\n[code of conduct]: https://www.dartlang.org/code-of-conduct", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM15", "speaker": "elmcrest", "conversation_id": "ROOT", "reply_to": "COM14", "timestamp": "2018-03-11T21:50:26Z", "text": "I also disagree to prefer typescript over dart for little snippets. The undefined, NaN, 0, false, null, whatever hell is one point, imports and package management still another...\r\nDart can really shine even for small snippets and if your build system is already setup anyway, why wouldn‘t I want to use dart for everything?\r\nOne truth tends to get hidden/ignored more and more these days: Javascript sucks! ;)", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM16", "speaker": "matanlurey", "conversation_id": "ROOT", "reply_to": "COM15", "timestamp": "2018-03-11T21:57:07Z", "text": "I'm locking this conversation for now since it's getting non-productive. This is something that is interesting to us, but it's not on the immediate roadmap at this time. Thanks for the feedback.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM17", "speaker": "kevmoo", "conversation_id": "ROOT", "reply_to": "COM16", "timestamp": "2019-03-08T21:02:39Z", "text": "We don't plan to support this API in the short term. None of our core users require it and would involve substantial effort to implement it correctly.", "meta": {"posReactions": "0", "negReactions": "0"}}
