{"id": "ROOT", "speaker": "Danielx64", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2019-12-19T10:22:04Z", "text": "The removal of Santa Hat on vscode insiders is very offensive and has nothing to do with religion  \r Steps to Reproduce:\r Install latest build of insiders.\r \r Does this issue occur when all extensions are disabled?: No\r \r Sorry but the guy who created https://github.com/microsoft/vscode/issues/87268 has it all wrong. Having a santa hat on a cog icon (to go to settings/options) has nothing to do with religion in any shape or form.\r \r I find it offensive that the hat was removed and it should never have been removed in the first place.\r ", "meta": {"posReactions": "144", "negReactions": "1"}}
{"id": "COM0", "speaker": "vscodebot[bot]", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2019-12-19T10:22:10Z", "text": "(Experimental duplicate detection)\nThanks for submitting this issue. Please also check if it is already covered by an existing one, like:\n- [Removal of the Santa hat and kowtowing to a single fake user is offensive to me (#87328)](https://www.github.com/microsoft/vscode/issues/87328) <!-- score: 0.579 -->\n- [Removal of the Santa Hat on vscode insiders is very offensive to me (#87296)](https://www.github.com/microsoft/vscode/issues/87296) <!-- score: 0.567 -->\n- [Santa Hat on vscode insiders and pushing of religion is very offensive to me (#87268)](https://www.github.com/microsoft/vscode/issues/87268) <!-- score: 0.526 -->\n- [Santa Hat removal on vscode insiders and bending to one jew is very offensive to me (#87291)](https://www.github.com/microsoft/vscode/issues/87291) <!-- score: 0.504 -->\n- [Removal of the Santa Hat and kowtowing to SJWs (#87314)](https://www.github.com/microsoft/vscode/issues/87314) <!-- score: 0.47 -->\n<!-- potential_duplicates_comment -->", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM1", "speaker": "arkadiuszwojcik", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2019-12-19T10:53:37Z", "text": "Two more things to add. @Christian-Schiffer have something against santa hat and releats it to religion. Pardon me but he dosn't distinguish between Saint Nicholas that was bishop and had totally diffrent hat and Santa Claus from popular culture who have other hat. Besides his name \"Christian\" smells like some kind of religious agitation and I think he should remove his account or be baned by highter autorities using his own argumentation preented in issue #87268 . Should I create separate issue for that?", "meta": {"posReactions": "36", "negReactions": "1"}}
{"id": "COM2", "speaker": "MaKiPL", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2019-12-19T10:56:12Z", "text": "User Christian-Schiffer that created such awful request offended many users and Microsoft just standing there like nothing happened. Bring back the Santa's hat!", "meta": {"posReactions": "19", "negReactions": "1"}}
{"id": "COM3", "speaker": "MaKiPL", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2019-12-19T10:59:33Z", "text": "to also add to that- The original requestor for this ridiculous change has 14 repositories from which 13 are forks. I doubt he's even a developer, just random troll that you- Microsoft fell for. Shame", "meta": {"posReactions": "14", "negReactions": "1"}}
{"id": "COM4", "speaker": "prometheus61", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2019-12-19T11:07:41Z", "text": "I liked the santa hat, it brought a little joy to my day. Very sad that it has been removed.", "meta": {"posReactions": "11", "negReactions": "1"}}
{"id": "COM5", "speaker": "Hissvard", "conversation_id": "ROOT", "reply_to": "COM4", "timestamp": "2019-12-19T11:07:52Z", "text": "I demand syntax highlighting be removed, as it reminds me of the other night when I puked out the three plates of ravioli I'd eaten. It is very offensive to me and instantly brings back memories of a very bad stomachache.\r\n\r\nSee this? That's how silly that was. We can't take people seriously just because they slap religion on something completely unrelated and pretend it's a serious issue.\r\n\r\nThat's offensive to **real** religious issues if anything. That's how real issues end up being taken as jokes.", "meta": {"posReactions": "13", "negReactions": "1"}}
{"id": "COM6", "speaker": "Phillipus", "conversation_id": "ROOT", "reply_to": "COM5", "timestamp": "2019-12-19T11:34:35Z", "text": "I find the \"V\" in \"VS Code\" offensive. It represents two fingers being held up in an obscene gesture and could be read as \"F*ck You\".", "meta": {"posReactions": "0", "negReactions": "1"}}
{"id": "COM7", "speaker": "leonardodelfinodev", "conversation_id": "ROOT", "reply_to": "COM6", "timestamp": "2019-12-19T11:47:53Z", "text": "I agree. Nowadays everyone is offended by everything. The fact that he doesn't like the hat has nothing to do with religion. I find Hissvard's comment \"That's offensive to real religious issues\" completely right. There are real religious issues by now, and classifying such a thing (the hat) as \"offensive\" should be considered shameful.", "meta": {"posReactions": "10", "negReactions": "1"}}
{"id": "COM8", "speaker": "ip413", "conversation_id": "ROOT", "reply_to": "COM7", "timestamp": "2019-12-19T12:03:10Z", "text": "Sad thing is that some of us are afraid of writing anything about it and they are writing from newly created accounts and... and I understand it. No one know who will be targeted and his life/career be destroyed by \"tolerance troops\" which have nothing to do with tolerance.\r\n\r\nWe are going into very, very gloomy era. \r\nChinese government (which is widely criticized by us) is doing the very same thing as \"political correctness\" is doing to us.\r\n\r\n**Whoever is afraid is a slave** - Seneca the Younger\r\nAnd we all are afraid - especially MS, as we could see.", "meta": {"posReactions": "0", "negReactions": "1"}}
{"id": "COM9", "speaker": "wolfensg", "conversation_id": "ROOT", "reply_to": "COM8", "timestamp": "2019-12-19T13:21:34Z", "text": "UpVote for Santa Hat! 🎅 Bring it back! Don't fall for the troll!", "meta": {"posReactions": "2", "negReactions": "2"}}
{"id": "COM10", "speaker": "dioptryk", "conversation_id": "ROOT", "reply_to": "COM9", "timestamp": "2019-12-19T13:41:45Z", "text": "We're moving to digital totalitarianism, pure and simple. In totalitarian state, anyone who voiced a different opinion than the state's, was forcibly silenced or 'disappeared'. Now, we have threads locked, accounts banned and single people deciding what's best for entire communities based on their 'feelings'. Well, I 'feel' it's pure evil masquerading as tolerance.", "meta": {"posReactions": "4", "negReactions": "0"}}
{"id": "COM11", "speaker": "shakeyourbunny", "conversation_id": "ROOT", "reply_to": "COM10", "timestamp": "2019-12-19T14:07:59Z", "text": "It is very telling the true colours on the side of the Microsoft team that this is still up in the air instead of making - as it would be a proper reaction - to write a short apology for the mistake, revert the change and be done with it. \r\n\r\nAdded bonus would have been that the whole issue would be forgotten for everyone in some days. \r\n\r\nSo, this leaves a very sour taste regarding the whole thing and it has already the very opposite intented effect of \"quick political correct reaction and stay clean\" for the whole Microsoft and only will be worse if this will not be corrected and sit out.\r\n\r\n\"Microsoft the Christmas Killer / Santa Killer\" in the press... not a nice thought and I guess this has the potential to escalate to widely known bad press for the organisation.\r\n\r\nMy advice to the managing team here:\r\n- don't wait it out and don't try to purge the taint when nobody's looking.\r\n- reinstate  the santa hat, at least make it a togglable option (default: on)\r\n- write a short paragraph that it was a mistake, include some funny joke for deescalation.\r\n- be done with it.\r\n", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM12", "speaker": "chrisdias", "conversation_id": "ROOT", "reply_to": "COM11", "timestamp": "2019-12-19T21:53:39Z", "text": "Thanks for creating this issue. We think this issue is unactionable or unrelated to the goals of this project. Please follow our [issue reporting](https://aka.ms/vscodeissuereporting) guidelines. \r\n\r\nHappy Coding! ", "meta": {"posReactions": "0", "negReactions": "0"}}
