{"id": "ROOT", "speaker": "nicknabdullah", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2019-10-22T03:35:35Z", "text": "Can't login for the last few days I'm trying to login for the last 3 days, using my google/github account but everytime getting the message: \r \r > \"Oops! Something went wrong. Please try again in a moment.\" \r \r I've tried clearing cache/cookies/incognito. But nothing is working. Also getting the same error when starting a project task. \r \r ![image](https://user-images.githubusercontent.com/13465486/67257769-48d6c680-f4af-11e9-8288-4c16cc3032f6.png)\r ", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM0", "speaker": "raisedadead", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2019-10-22T07:23:27Z", "text": "Hi @nicknabdullah \r\n\r\nChances are you have a duplicate account. Please email us at `supporr@freecodecamp.org` and We will try and get this resolved for you.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM1", "speaker": "cinziaa", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2019-10-22T09:34:49Z", "text": "Hi @raisedadead \r\nI've the same issue. I've tried revoking and granting access with Github and login with email and Google, but nothing. \r\nI hope you solve it soon. Thanks\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM2", "speaker": "raisedadead", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2019-10-22T10:50:24Z", "text": "> ### Chances are you have a duplicate account.\r\n\r\n**How to fix?**\r\n\r\n> #### Please email us at `support@freecodecamp.org` and we will get this resolved for you.\r\n\r\n**But why would I have duplicate accounts?**\r\n\r\nBack in June 2018, we had updated our platform. At that time, a bug had caused account duplications for some users. \r\n\r\nWith the recent Oct, 2019 update to the platform, we have identified that the bug was fixed but the account duplications remain in the database. These unfortunately have to fixed by our team manually. Users have progressed with the curriculum since last year and a programmatic fix may not be possible.\r\n\r\nNone of your progress is gone or lost. They are simply lying in a different account with the same email address or username attached to it.\r\n\r\n**Does this affect how I login? Can I use GitHub or other logins**\r\n\r\nWe simply rely on the email address that is received by us, as long as GitHub, Facebook, Google are returning the same email you have with us you will be signed into your correct account.\r\n\r\nThanks for your patience, and understanding with this. The newer platform is more resilient and we look forward to your feedback \r\n\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM3", "speaker": "moT01", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2020-09-08T18:42:39Z", "text": "Closing as stale. Please read the comment above if you are having issues with your account. Thanks and happy coding 🎉 ", "meta": {"posReactions": "0", "negReactions": "0"}}
