{"id": "ROOT", "speaker": "nikolayval", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-02-29T04:13:58Z", "text": "How I can add Yandex RTB (Ads-code) to Gatsby? Hello!\r \r I'm using Gatsby-MDX for my posts. And I want to add Yandex RTB-code to my site. \r \r It's Google Adsense alternative from Yandex (in Russia). Here is example, how is looking Yandex RTB-code:\r \r ```\r <div id=\"rtb-1\"></div>\r <script type=\"text/javascript\">\r     (function (w, d, n, s, t) {\r         function renderRtb () {\r             Ya.Context.AdvManager.render({\r                 blockId: \"R-A-12345-1\",\r                 renderTo: \"rtb-1\",\r                 statId: 34567, // CROSS SECTION ID\r                 async: true\r             });\r         }\r         w[n] = w[n] || [];\r         w[n].push(renderRtb);\r         t = d.getElementsByTagName(\"script\")[0];\r         s = d.createElement(\"script\");\r         s.type = \"text/javascript\";\r         s.src = \"http://an.yandex.ru/system/context.js\";\r         s.async = true;\r         t.parentNode.insertBefore(s, t);\r     })(this, this.document, \"yandexContextAsyncCallbacks\");\r </script>\r ```\r \r Please, sir, tell me. What's there is best way to insert Yandex Ads into my MDX-posts? For example, can I create .txt-file. Then import .txt file (with Ads code) where I need into my MDX-posts?", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM0", "speaker": "blainekasten", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-02-29T16:16:07Z", "text": "Hey @nikoladev I'm assuming this is just some code you need to insert into the `head` element. If so, this document will tell you how to customize the html output. Follow the steps and put this script tag in the head tag. I'm not sure what else Yandex needs, but this is generally how google adsense works.\r\n\r\nhttps://www.gatsbyjs.org/docs/custom-html/\r\n\r\nI'm going to close this issue as I don't believe it's reporting a problem with Gatsby. I'm happy to keep the discussion going, so don't take this as a negative sign. Please report back if you need continued support! 😃", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM1", "speaker": "nikolayval", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2020-03-01T02:50:24Z", "text": "No, I don't need to insert a showed code between `<head>` tag's or in the footer. \r\n\r\nI should to insert the code into my MDX-posts. And it's show my Yandex Ads into my posts.\r\n\r\nFor example, I want to show Ads in the center of my MDX-posts. Or after some H2-tags etc. \r\n\r\nHow I can insert my code into MDX-posts?", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM2", "speaker": "pvdz", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2020-03-10T11:00:49Z", "text": "@nikolayval Feels to me like this is more of an MDX question than Gatsby, is it not? I have little experience with MDX. Gatsby takes the MDX content and uses Babel (etc.) to generate the web pages. It's not really aware of this.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM3", "speaker": "DSchau", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2020-03-13T17:06:13Z", "text": "@nikbelikov You can do something like this: https://github.com/gatsbyjs/gatsby/blob/master/www/src/components/script-loader.js (and then you'd use a component for those ads that uses that component, and then you'd use that wrapping component in MDX)\r\n\r\nPlease in the future be a bit more careful in how you approach soliciting help from this community. We're glad to have you here, and value you using Gatsby, but we want to also be kind in how we request help from the core maintainers of Gatsby.", "meta": {"posReactions": "0", "negReactions": "1"}}
{"id": "COM4", "speaker": "nikolayval", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2020-03-13T17:15:19Z", "text": "**Dschau**, thank you very much for answer. You are the best, and thank you thank you thank you thank you thank you! \r\n\r\nBut sorry, it's bullshit solution. \r\n\r\nIf I want to display specific script (in my case - it's Yandex Ads, like Google Adsense alternative from Russia) in MDX-posts (or markdown files), then I should create a custom script components with specific attributes. It's very hard and not convenient. \r\n\r\nMaybe Gatsby team can create plugin to render custom scripts into MDX or markdown files? I want to display Yandex Ads, Amazon Ads, Yahoo Ads or something else. And each time I should create hard components? WTF? ", "meta": {"posReactions": "0", "negReactions": "3"}}
{"id": "COM5", "speaker": "DSchau", "conversation_id": "ROOT", "reply_to": "COM4", "timestamp": "2020-03-13T18:13:24Z", "text": "Then you would do something slightly different. It's hard to predict what you want, because it's not clear what you want.\r\n\r\nHere's an example Codesandbox that gets _closer_ to what you want, but it's still not working. This being said, I also wasn't even able to get the snippet you pasted above working, so I'm skeptical of the general approach.\r\n\r\n[React Codesandbox](https://codesandbox.io/s/angry-sun-4dfmf) | [Vanilla Codesandbox](https://codesandbox.io/s/festive-surf-4t6k4)\r\n\r\n> Failed to load resource: the server responded with a status of 404 ()\r\n\r\nI'm going to lock this, as I don't find this discussion productive nor valuable for us to be having. This is very much not a Gatsby problem, and is a general issue with loading Yandex scripts.\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
