{"id": "ROOT", "speaker": "vsfeedback", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2018-08-24T00:40:21Z", "text": "Incorrect formatting of C# comments When you want to disable (but not delete) a field etc in a C# class, you comment it out by writing &quot;//&quot; at the start of the line, but this causes VS 15.8.0 to incorrectly format the line when the previous line ends with a comment.  You can understand this much easier when you look at my screenshot attached.\r \r To reproduce this bug, first put this class in a .cs file:\r \r ```csharp\r class ExampleClass1\r {\r     int ExampleField1;\r     int ExampleField2;  // Some comment here.\r     //int ExampleField3;\r     int ExampleField4;\r }\r ```\r \r Then select the text (select the entire class).  Then click menubar -&gt; Edit -&gt; Advanced -&gt; Format Selection.  VS changes the class to:\r \r ```csharp\r class ExampleClass1\r {\r     int ExampleField1;\r     int ExampleField2;  // Some comment here.\r                         //int ExampleField3;\r     int ExampleField4;\r }\r ```\r \r ![image](https://user-images.githubusercontent.com/12449387/44558946-c3655400-a6fb-11e8-9a75-b6960e057a2d.png)\r \r \r The bug also occurs when VS formats the class at other times, not only the &quot;Format Selection&quot; command.  See the &quot;Automatically format when/on XXXXX&quot; options in menubar -&gt; Tools -&gt; Options -&gt; Text Editor -&gt; C# -&gt; Code Style -&gt; Formatting -&gt; General.\r \r Thanks for investigating this!\r \r _This issue has been moved from https://developercommunity.visualstudio.com/content/problem/317225/incorrect-formatting-of-c-comments.html\r VSTS ticketId: 668245_\r _These are the original issue comments:_\r \r Etienne Poirier on 8/21/2018, 04:35 PM (2 days ago): <p>Same issue as </p><p><a target='_blank' href=\"https://developercommunity.visualstudio.com/content/problem/317225/https://developercommunity.visualstudio.com/content/problem/20554/line-comments-unwantedly-align-to-comment-above-in.html\">https://developercommunity.visualstudio.com/content/problem/20554/line-comments-unwantedly-align-to-comment-above-in.html</a></p><p>Thank you to check this.</p>\r \r _These are the original issue solutions:_\r (no solutions)", "meta": {"posReactions": "5", "negReactions": "0"}}
{"id": "COM0", "speaker": "CyrusNajmabadi", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2018-08-24T01:24:39Z", "text": "This seems by design to me...  it's a common pattern to have multi-line comments at the end of constructs, and to align them across multiple lines.\r\n\r\nIn this case, we don't really have any way to know or believe that this isn't one of those cases, and aligning the comments as shown seems reasonable in terms of respecting the common pattern that is out there.", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM1", "speaker": "jinujoseph", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2018-09-03T09:15:49Z", "text": "~~Also referred [here](https://developercommunity.visualstudio.com/content/problem/324827/vs2017-undesired-reformatting-when-uncommenting-a.html)~~ (edit: this was moved to #29647)", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM2", "speaker": "verelpode", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2018-09-05T21:54:01Z", "text": "> This seems by design to me...\r\n\r\nI can't really agree with you because VS 15.8.2 also does it when the first comment is single-line `//` and the second comment is multi-line `/* */`\r\nThe following shows the result after executing the \"Format Document\" command:\r\n```\r\nint ExampleField2;  // Some comment here.\r\n                    /*\r\n                    int ExampleField3;\r\n                    int ExampleField4;\r\n                    int ExampleField5;\r\n                    */\r\n\r\n```\r\n\r\nI don't believe that anyone wants the above formatting.\r\n\r\n>  it's a common pattern to have multi-line comments at the end of constructs, and to align them across multiple lines.\r\n\r\nI never do that, and apparently multiple other people also never do that, therefore I suggest making a checkbox in the Options window, so that people can simply switch this behavior on or off as desired. \r\nHowever, in my opinion, the mixed example above seems to be a bug not a feature.", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM3", "speaker": "dibarbet", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2019-02-05T18:53:31Z", "text": "@sharwell do you recall if there was an outcome for this in design review, or does it still need to be discussed?", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM4", "speaker": "sharwell", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2019-02-05T19:28:15Z", "text": "@dibarbet This one is still in the queue", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM5", "speaker": "dibarbet", "conversation_id": "ROOT", "reply_to": "COM4", "timestamp": "2019-02-05T19:30:11Z", "text": "Thanks for confirming, wanted to make sure.  I'll park these 2 until the next meeting then.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM6", "speaker": "sharwell", "conversation_id": "ROOT", "reply_to": "COM5", "timestamp": "2019-04-08T19:28:45Z", "text": "I'm bringing this to a design review today. My proposal is as follows:\r\n\r\n* The current behavior is generally by design\r\n* We could modify the current behavior in the case where a line comment starting with a space is followed by a line comment _not_ starting with a space:\r\n\r\n    ```csharp\r\n    int x; // This comment starts with a space\r\n           //This comment did not start with a space\r\n    ```\r\n\r\n    For this case, the first line comment not starting with a space would be aligned with `int` instead of the current behavior of aligning it with `//`.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM7", "speaker": "CyrusNajmabadi", "conversation_id": "ROOT", "reply_to": "COM6", "timestamp": "2019-04-08T19:29:57Z", "text": "Note that some linters will complain if you don't start your comment without a space.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM8", "speaker": "sharwell", "conversation_id": "ROOT", "reply_to": "COM7", "timestamp": "2019-04-08T19:32:35Z", "text": "@CyrusNajmabadi Other linters will complain about comments at the end of a line of code. Most relevant to this issue though is the fact that most cases where I've seen this reported as a bug, including the original example above, do not have a space on the line of code that the user did not want to see indented.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM9", "speaker": "verelpode", "conversation_id": "ROOT", "reply_to": "COM8", "timestamp": "2019-04-08T19:45:51Z", "text": "> most cases where I've seen this reported as a bug, including the original example above, do not have a space on the line of code that the user did not want to see indented.\r\n\r\nThat's an interesting pattern observation, but I think you'd like to see this issue fixed and terminated forever, but I fear that if the solution relies upon whether or not that particular space character exists, then it will be precarious and this issue will in future again be reported as a bug, instead of being laid to rest permanently.  Did you dislike the idea of solving it via a tickable option in the Options window?\r\n\r\nAnother case to remember is **mixed** comment types, such as the following example.  The solution for mixed comments appears to be simple and unambiguous and does not require an option in the Options window.  If the second comment is a different type than the first comment, then the second comment should **never** be indented to match the first comment, thus VS should never produce the following:\r\n```\r\nint ExampleField2;  // Some comment here.\r\n                    /*\r\n                    int ExampleField3;\r\n                    int ExampleField4;\r\n                    int ExampleField5;\r\n                    */\r\n```\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM10", "speaker": "verelpode", "conversation_id": "ROOT", "reply_to": "COM9", "timestamp": "2019-04-08T20:02:24Z", "text": "If the idea of putting it in the Options window is rejected, then I'm trying to brainstorm an alternative solution, and I thought about _maybe_ making VS look for a tab character in the place marked with \"\\t\" following:\r\n```\r\nint x;\\t// This comment is preceded by one or more tab characters.\r\n// This comment would never be aligned with the previous comment.\r\n\r\nint x; // This comment is preceded by one or more space characters.\r\n       // This comment would be aligned with the previous comment.\r\n```\r\n\r\nOn my computer, I have `Options -> Text Editor -> C# -> Tabs` set to \"Keep tabs\".  I can't stand the \"Insert spaces\" option.  I always use tab in-between \";\" and \"// comment\".  Despite the fact that I have VS set to \"Keep tabs\", when I copy & paste a line or otherwise trigger VS to format the line, VS changes my tabs to spaces.  I wish it wouldn't do that.\r\n\r\nI write it with tabs like this:\r\n```\r\nint x;\\t\\t// Comment. \r\n```\r\n...and VS 2019 changes my tabs to spaces against my wishes:\r\n```\r\nint x;     // Comment. \r\n```\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM11", "speaker": "CyrusNajmabadi", "conversation_id": "ROOT", "reply_to": "COM10", "timestamp": "2019-04-08T20:09:54Z", "text": "I thnk i'd much rather have the rule that the `//`s are aligned if they abut.  BUt not if there's a blank line between them.  So, if you have:\r\n\r\n```c#\r\nint foo; //a comment\r\n         //this follow the above\r\n```\r\n\r\nand\r\n\r\n```c#\r\nint foo; //a comment\r\n\r\n//this does not\r\n```\r\n\r\nNeeding to understand that having a space (or not) would affect alignment of comments seems super strange to me.  Whereas, if there's this obvious gap between them, it would make it much more clear if they were intended to *not* be together.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM12", "speaker": "CyrusNajmabadi", "conversation_id": "ROOT", "reply_to": "COM11", "timestamp": "2019-04-08T20:10:25Z", "text": "> Another case to remember is mixed comment types,\r\n\r\nYes, i think i would agree that mixed comment types should not align here.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM13", "speaker": "verelpode", "conversation_id": "ROOT", "reply_to": "COM12", "timestamp": "2019-04-08T20:13:30Z", "text": "Wait, here is another alternative solution, better than my previous brainstorming.\r\nVS would only increase the indenting of a comment if it is _already_ indented by at least one space or tab char.  Example:\r\n```\r\nint x;  // First comment.\r\n    // VS would align this comment with the first comment because it is already indented.\r\n\r\nint y; // Blah blah.\r\n// This comment would never be aligned with the previous comment.\r\n```\r\n\r\nThus the final result is:\r\n```\r\nint x;  // First comment.\r\n        // VS would align this comment with the first comment because it is already indented.\r\n\r\nint y; // Blah blah.\r\n// This comment would never be aligned with the previous comment.\r\n```\r\n\r\nIn other words, if a comment is aligned with \"int x;\" then it remains at that level, but if it already indented beyond \"int x;\" by one or more space or tabs, then VS aligns it with the previous comment.\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM14", "speaker": "verelpode", "conversation_id": "ROOT", "reply_to": "COM13", "timestamp": "2019-04-08T20:20:47Z", "text": "> Needing to understand that having a space (or not) would affect alignment of comments seems super strange to me. Whereas, if there's this obvious gap between them, it would make it much more clear if they were intended to not be together.\r\n\r\nI agree, but that's identical to the current behavior of VS 2019, therefore it would continue to trigger bug reports.  So how about making VS only increase the indenting of a comment when it is _already_ indented further right than `int x;` ?    If a comment is currently exactly aligned with `int x;`, then why should VS think that a preexisting exact alignment is incorrect?", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM15", "speaker": "verelpode", "conversation_id": "ROOT", "reply_to": "COM14", "timestamp": "2019-04-08T20:43:22Z", "text": "Note that if the formatting of comments is influenced by the preexisting formatting/spacing (in the manner as I described above), then this behavior is _not at all_ unusual nor inconsistent with other VS formatting behavior, because VS formatting is _already_ influenced by the preexisting spacing.  For example, when I run the \"Format Selection\" command on the following code in VS 2019 on my own computer, VS doesn't change the code at all.  VS respects the fact that I wrote TestProperty2 on a single line and it leaves it on a single line.\r\n\r\n```\r\nint TestProperty1\r\n{\r\n    get\r\n    {\r\n        return 123;\r\n    }\r\n}\r\n\r\nint TestProperty2 { get { return 456654; } }\r\n```\r\n\r\nIn the same way as VS retains my preexisting formatting of a property, it can retain my preexisting formatting of a comment.\r\n```\r\nint x; // Blah blah.\r\n// This comment is already exactly aligned with \"int x;\" \r\n// thus there is NO reason to think it's wrongly aligned.\r\n\r\nint y;   // another comment\r\n   // this comment does look wrong and should be reformatted.\r\n```\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM16", "speaker": "CyrusNajmabadi", "conversation_id": "ROOT", "reply_to": "COM15", "timestamp": "2019-04-08T20:45:36Z", "text": "@verelpode in general we haven't had that concept in the formatting engine yet.  But i'm personally amenable to it.  I think it's a reasonable approach that would give the user some level of control here in a manner that would be reasonably intuitive.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM17", "speaker": "sharwell", "conversation_id": "ROOT", "reply_to": "COM16", "timestamp": "2019-04-08T21:05:27Z", "text": "**Design review summary:**\r\n\r\nThe current general recommended approach is to add a blank line before the comment which should not have the extra indentation. However, to address the specific issue here, we would take a pull request which added a conditional formatting rule where comments _already aligned_ where code would be indented on the same line will anchor at that location instead of the current behavior of anchoring to the trailing comment on the preceding line.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM18", "speaker": "verelpode", "conversation_id": "ROOT", "reply_to": "COM17", "timestamp": "2019-04-08T21:15:30Z", "text": "Great, I think this solution will successfully prevent this issue being reported in future again as a bug.  To my surprise, it was even possible to satisfy all users automatically without the burden of creating yet another option in the Options window.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM19", "speaker": "HappyNomad", "conversation_id": "ROOT", "reply_to": "COM18", "timestamp": "2019-05-09T19:13:27Z", "text": "This horribly annoying behavior in Visual Studio bothered me multiple times today.  It's so unbelievably annoying!  I'll upgrade to VS 2019 just for this improvement once it's available.  I'm anxiously awaiting.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM20", "speaker": "jcouv", "conversation_id": "ROOT", "reply_to": "COM19", "timestamp": "2019-07-14T05:10:05Z", "text": "I've encountered this problem in Roslyn as well. The current behavior is annoying. See `CS1720WRN_DotOnDefault02` for an example.\r\n\r\nOriginal code (with formatting warning):\r\n![image](https://user-images.githubusercontent.com/12466233/61179603-87a8d680-a5ba-11e9-8e5e-7f2c7d2e1316.png)\r\n\r\n`1>C:\\repos\\roslyn\\src\\Compilers\\CSharp\\Test\\Semantic\\Semantics\\SemanticErrorTests.cs(21922,17,21922,17): warning IDE0055: Fix formatting`\r\n\r\nCode with formatting fix applied, but undesirable formatting:\r\n![image](https://user-images.githubusercontent.com/12466233/61179606-9e4f2d80-a5ba-11e9-88f9-a880063ea6e2.png)\r\n\r\nThis is using 16.2p3.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM21", "speaker": "jinujoseph", "conversation_id": "ROOT", "reply_to": "COM20", "timestamp": "2019-09-10T01:11:25Z", "text": "also reported [DC](https://developercommunity.visualstudio.com/content/problem/719204/comment-code-style.html) ", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM22", "speaker": "HappyNomad", "conversation_id": "ROOT", "reply_to": "COM21", "timestamp": "2019-10-31T04:27:48Z", "text": "@jinujoseph Why is it moved to the backlog?  This keeps coming up and it is SO ANNOYING.  How about just adding an option to turn this nonsense off?", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM23", "speaker": "CyrusNajmabadi", "conversation_id": "ROOT", "reply_to": "COM22", "timestamp": "2019-10-31T07:08:33Z", "text": "@ChainReactive as mentioned in this post here: https://github.com/dotnet/roslyn/issues/29482#issuecomment-481007848\r\n\r\n> The current general recommended approach is to add a blank line before the comment which should not have the extra indentation. However, to address the specific issue here, we would take a pull request which added a conditional formatting rule where comments already aligned where code would be indented on the same line will anchor at that location instead of the current behavior of anchoring to the trailing comment on the preceding line.\r\n\r\nIn other words, if a community member wanted to contribute such a PR, roslyn would take it.  however, absent that, the advice would be to just put in a blank line in the code.  \r\n\r\nIf this is something you are passionate about (which seem evidenced by https://github.com/dotnet/roslyn/issues/29482#issuecomment-491030328 and https://github.com/dotnet/roslyn/issues/29482#issuecomment-548212118) perhaps you would be willing to help out here with a PR yourself?  \r\n\r\nNote that there are a couple of good channels to help out people working to contribute toward roslyn (internal and external alike):\r\n\r\ngitter.im/dotnet/roslyn and\r\naka.ms/csharp-discord\r\n\r\nCheers!", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM24", "speaker": "HappyNomad", "conversation_id": "ROOT", "reply_to": "COM23", "timestamp": "2019-10-31T07:39:17Z", "text": "@CyrusNajmabadi, @sharwell  Visual Studio is a commercial product with a dedicated team on staff at Microsoft.  I'm not already familiar with Roslyn, nor do I have time to dive down that rabbit hole.  The people who's job it is to improve Visual Studio's user experience would be better equipped to fix this.\r\n\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM25", "speaker": "CyrusNajmabadi", "conversation_id": "ROOT", "reply_to": "COM24", "timestamp": "2019-10-31T08:10:13Z", "text": "> @CyrusNajmabadi, @sharwell Visual Studio is a commercial product with a dedicated team on staff at Microsoft.\r\n\r\nIt's also an open source project with a community that actively contributes to it and provides PRs when their needs don't align with the priorities of the main team itself.  I'm one of those people and have contributed as an external community member a large number of times.\r\n\r\nAs i've already pointed out, the stated view of the team is that there is an easy workaround if hte current behavior is undesirable to you.  If that workaround is not tenable and you want to see this fixed, it will have to come from a PR from someone willing to view the change as valuable enough to invest their own time.\r\n\r\nI personally don't feel like it's worth fixing myself, but i'd be happy to help you with a PR to change if it is something that is affecting you.\r\n\r\n> The people who's job it is to improve Visual Studio's user experience \r\n\r\nAs an open source project, \"the people\" includes the community (including you, me, and other interested parties).  \r\n\r\n> would be better equipped to fix this.\r\n\r\nYes, that's likely true.  But they're also tasked with work felt to be more important and a more valuable use of their time.  And so here we are. ", "meta": {"posReactions": "2", "negReactions": "0"}}
{"id": "COM26", "speaker": "HappyNomad", "conversation_id": "ROOT", "reply_to": "COM25", "timestamp": "2019-10-31T09:07:23Z", "text": "@CyrusNajmabadi I'd welcome your assistance in making up for Microsoft's negligence.  As I've already mentioned, I don't have time to get into Roslyn.  How about I send you my kudos once you fix this bug?  But if your Roslyn skills aren't up to stuff, then don't worry about it.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM27", "speaker": "CyrusNajmabadi", "conversation_id": "ROOT", "reply_to": "COM26", "timestamp": "2019-10-31T09:40:02Z", "text": "> @CyrusNajmabadi I'd welcome your assistance in making up for Microsoft's negligence. \r\n\r\nTeams prioritizing things different from you is not negligence.  There are millions of users and thousands of signals indicating what is valuable and important to actually address with the resources available.  This minor issue simply isn't one of those.  I can imagine you probably have to make similar decisions in your own work when deciding where to allocate your own resources.\r\n\r\n> How about I send you my kudos once you fix this bug? \r\n\r\nI am personally not interesting in contributing a PR here.  Primarily because i don't find the behavior particularly problematic, nor do i feel that the workaround is insufficient.\r\n\r\nStill happy to help you out at any point if you change you mind.  The links to the channels still apply.   Cheers!", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM28", "speaker": "CyrusNajmabadi", "conversation_id": "ROOT", "reply_to": "COM27", "timestamp": "2019-10-31T09:42:25Z", "text": "> But if your Roslyn skills aren't up to stuff, then don't worry about it.\r\n\r\nWhen it comes to this area, they may not be.  Hence why I was offering to work through it with you.  Two minds being better than one and all that :)  \r\n\r\nCheers and good luck!  If you change your mind, just let me know! :)", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM29", "speaker": "HappyNomad", "conversation_id": "ROOT", "reply_to": "COM28", "timestamp": "2019-10-31T10:13:29Z", "text": "> Teams prioritizing things different from you is not negligence\r\n\r\nI disagree with you on this in the current context.  The (ir)responsible team at Microsoft is neglecting a lot of users by not fixing this bug.  Just google \"visual studio c# turn off align comments\" to see.\r\n\r\n> This minor issue simply isn't one of those.\r\n\r\nIt is a \"minor issue\" in that it'd be easy for them to fix, although the choose not to.  It's not a \"minor issue\" in that it is indeed super annoying.", "meta": {"posReactions": "0", "negReactions": "0"}}
