{"id": "ROOT", "speaker": "bnb", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2021-05-06T18:48:22Z", "text": "Rename Node-API to something less confusing/misleading <!--\r Thank you for suggesting an idea to make Node.js better.\r \r Please fill in as much of the template below as you're able.\r -->\r \r **Is your feature request related to a problem? Please describe.**\r There was recently a decision to rename N-API to Node-API. I believe this is a poor decision that will result in actively harmful results for both users of the API and general Node.js users.\r \r Specifically, there are multiple problems with this naming:\r \r - Building APIs are a common use case for Node.js. This naming can lead to confusing information or misleading search results.\r - Products often refer to the way to access their services with JavaScript or Node.js as their \"JavaScript API\". If people want to use this from Node.js, there is a non-trivial chance they will look for \"Node.js API\" which will lead to confusing results.\r - Node.js itself has an API, which theoretically includes this API. Naming a part of the whole the same thing as the whole is immensely confusing from an education perspective.\r - This API is far less likely to be used than other parts of the Ndoe.js API, which leads to an exacerbation of challenge presented by the problems above.\r \r **Describe the solution you'd like**\r \r Rename Node-API to something else.\r \r **Describe alternatives you've considered**\r - Undoing Node-API rename, moving it back to N-API. \r   -  There is a reason a rename was done initially, and that reason is valid.\r - Leave it as is.\r   - This is going to be actively harmful to communication and education n the long-run.", "meta": {"posReactions": "7", "negReactions": "0"}}
{"id": "COM0", "speaker": "mhdawson", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2021-05-06T18:57:27Z", "text": "For context the rename/work is complete. The blog post which explains the changes is https://nodejs.medium.com/renaming-n-api-to-node-api-27aa8ca30ed8.\r\n\r\nThe node-api team was asked to change the name in: https://github.com/nodejs/abi-stable-node/issues/420 . Being sensitive to the concern the team took on this extra work.\r\n\r\n\r\n", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM1", "speaker": "Trott", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2021-05-10T04:13:30Z", "text": "Repeating [what I wrote 3 months ago](https://github.com/nodejs/TSC/issues/967#issuecomment-773031602):\r\n\r\n> I support changing the name N-API to something else, but the new term does have an obvious downside. The term \"Node API\" already has a straightforward meaning. Applying it to a specific API is more vague than descriptive.\r\n> \r\n> That said, I don't know that I have better ideas. (Native Bindings API? Addon API? ABI Stability API?)\r\n\r\nI'll also add that `Node API` is somewhat contrary to our years-long efforts to have the name of the runtime spelled `Node.js` and not `Node` (or `NodeJS` or a number of other variatns). \r\n\r\nOf course, now that the name change has already happened, there are significant costs/downsides to changing the name a second time in such a short period of time. I'd still support it, though, if the name was more descriptive and not subject to misinterpretation. A better name is better for our users.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM2", "speaker": "jasnell", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2021-05-20T22:52:51Z", "text": "I'm -1 on changing the name again and I appreciate the effort the node-api team put into making the changes. It's a good change. ", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM3", "speaker": "mhdawson", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2022-06-03T15:38:29Z", "text": "This was discussed in the Node-API team meeting today and and consensus was we don't think we want/will change at this point. Some of the team members could not comment directly since it was locked.", "meta": {"posReactions": "0", "negReactions": "0"}}
