{"id": "ROOT", "speaker": "Avamander", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-07-10T13:17:17Z", "text": "IPython doesn't follow the XDG base directory specification Currently IPython uses `~/.ipython` which just clutters people's home directories and makes things like backing up configuration files much more hassle than it should be. \r \r This was last discussed more than five years ago and should be discussed again. Points made at that point in time frankly, don't really hold up. It is more consistent to follow platform specs, people learn where to look first. Secondly, for support reasons, you don't really have to ask what platform they're on, just mention the three paths in one sentence, it's actually rather easy. ", "meta": {"posReactions": "2", "negReactions": "0"}}
{"id": "COM0", "speaker": "adamroyjones", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-07-19T11:05:02Z", "text": "For those looking for the previous discussion, it can be found [here](https://github.com/ipython/ipython/pull/4457).", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM1", "speaker": "Carreau", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2020-07-21T00:17:54Z", "text": "I believe if you move your folders in XDG compliant places it should work, though updating all the code and documentation all over the internet, plus the code to do the right thing is a lot of work; and XDG spec IIRC did not completely match or was not clear for all the types of files that could be present. \r\n\r\nThere might be packages on PyPI that may help with ~/.config /User/.../Libraries/AppData. %appdata% depending on OS, and this will also likely need to touch all the jupyter ecosystem (ipykernel, jupyter_client, traitlets, etc, so I doubt there'll be an effort from core dev to push that forward.\r\n\r\nTHough if you have issues when files _exists_ in XDG placed and not found I\"ll be happy to get fixes in. ", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM2", "speaker": "Avamander", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2020-07-21T00:58:26Z", "text": "@Carreau \r\n\r\nYou're being a bit facetious. There's no need to update \"all the code and documentation all over the internet\", nobody has every done that and never will. Neither would the updating even be necessary, the official documentation should contain the location of the configuration file, that's it. The third silly thing is that you're acting like IPython doesn't have any changes that break some pieces of code or tutorials out there. All in all it makes your comment seem more like irrational stubbornness than actual concerns.\r\n\r\nNot to mention, if it's _that_ hard to change the folder, then that hardcoding seems like a massive code smell anyways and should be fixed anyways, and the choice to set the location of the folder should be up to the user.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM3", "speaker": "Carreau", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2020-07-21T01:43:18Z", "text": "Hey, I was there for the first or changing default configuration directory, and all the issues it created; And I'm one of the person who has to deal both with public and private requests about the bits of documentation that users have tried on the internet and does not work because its inaccurate, either when it was written or because IPython changed, so yes I'm well aware of the consequences of changing. \r\n\r\nAnd so yes the official documentation is one of the last place users looks for that information, and yes sometime they look at the latest docs for 5 years old IPython version.\r\n\r\nYes `~/.ipython` is not optimal, and no it's not a code smell we removed all the complex logic because it was brittle and was super confusing, and because every time we were teaching software carpentry there was section with all the combinaisons of linux/mac/windows IPython version x.y.z\r\n\r\nSo yes I was of your opinion 10 years ago, and no to this days I still don't know the 3 path on each of the platform, even on Mac which I'm using everyday and which now hides ~/Library in the finder.\r\n\r\nYou can change the code location by setting environment variables, and I told you that if it was not working with configuration in xdg dir I would gladly accept patches for that so that you have  the choice. \r\n\r\nNow if it's to criticize the code without proper understanding of the technical and social reason of why it is the way it is, and bring XDG zealotry into the mix, I'm even less likely to make an effort.\r\n\r\nPR still accepted but discussion closed.\r\n\r\n ", "meta": {"posReactions": "0", "negReactions": "0"}}
