{"id": "ROOT", "speaker": "jbgraug", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2017-02-16T16:01:43Z", "text": "Typescript should follow semantic versioning   I guess this can be considered as a bug as it is breaking my apps.\r If version 2.1.0 has breaking changes, why don't set it to 3.0.0?  Semantic versioning, right?\r Typescript lives and has important role in the nodejs ecosystem, therefore should follow some basic rules.\r We can not use the npm's semver features to block only major changes.\r \r **TypeScript Version:**  2.1.1 / nightly (2.2.0-dev.201xxxxx)\r > 2.1.0\r **Code**\r ```ts\r // A *self-contained* demonstration of the problem follows...\r No need\r ```\r **Expected behavior:**\r Follow semantic versioning rules\r **Actual behavior:**\r Just follows marketing versioning rules\r can be related to https://github.com/Microsoft/TypeScript/issues/6520 created a year ago and closed without being solved", "meta": {"posReactions": "32", "negReactions": "2"}}
{"id": "COM0", "speaker": "mhegazy", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2017-02-16T18:08:50Z", "text": "TypeScript never claimed to follow semantic versioning, in the sense that breaking changes imply major versions.\r\n\r\nTypeScript, however, promises no breaking changes after a stable release. so no breaking changes between `2.1.5` and `2.1.6`, `2.1.*`.\r\n\r\nMy recommendation is fix your version of typescript to `major.minor` instead of just major. e.g. `^2.1` and not `^2`", "meta": {"posReactions": "5", "negReactions": "0"}}
{"id": "COM1", "speaker": "jbgraug", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2017-02-17T06:44:46Z", "text": "Thanks for the early response @mhegazy .\r\nAs you mentioned, blocking the versions is easy to fix in my projects (I was being a bit ironic.). \r\nHowever, as a developer i don't feel comfortable having to memorise a different set of rules for each package as the number of packages used grows very quickly.\r\nI guess having typescript follow semantic versioning would be a nice to have feature.", "meta": {"posReactions": "19", "negReactions": "0"}}
{"id": "COM2", "speaker": "RyanCavanaugh", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2017-02-17T08:55:24Z", "text": "The trade-off for getting millions of dollars of engineering investment in the TypeScript project is that marketing gets to control version numbers to a certain extent.\r\n\r\nIt's not really an unalloyed good anyway. If we followed semver rules exactly, literally every single release would be a major version bump. Any time we produced the wrong type or emitted the wrong code or failed to issue a correct error, that's a breaking change, and we fix dozens of bugs like that in every release. The middle digit just isn't useful for TypeScript in a strict semver interpretation.", "meta": {"posReactions": "18", "negReactions": "24"}}
{"id": "COM3", "speaker": "niieani", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2017-02-19T12:18:39Z", "text": "NPM should simply allow for descriptive marketing versions as a forth group. Then we'd have the best of both worlds, i.e.\r\n\r\n```json\r\n       marketing\r\n           ∨\r\nTypeScript 2.34.2.1 \r\n             ∧∧ ∧ ∧\r\n          major ∧ patch\r\n                ∧\r\n              minor\r\n```\r\n\r\nYou would simply skip the marketing version while installing, i.e. `npm install typescript@^34` since it would hold no semantic meaning, i.e. bumping marketing wouldn't reset the `major` counter.", "meta": {"posReactions": "7", "negReactions": "0"}}
{"id": "COM4", "speaker": "BenSayers", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2017-04-07T01:15:07Z", "text": "I'm concerned that not following semver is creating unnecessary friction for TypeScript consumers who are opted in to having their builds broken whenever TypeScript releases a minor version as npm locks down to only major versions by default. The Microsoft Edge team has figured out how to do their marketing despite bumping the major version a few times a month (currently up to v38), I think TypeScript should give serious consideration to doing the same for the good of its consumers.", "meta": {"posReactions": "2", "negReactions": "1"}}
{"id": "COM5", "speaker": "aluanhaddad", "conversation_id": "ROOT", "reply_to": "COM4", "timestamp": "2017-04-07T02:32:02Z", "text": "Personally, I think it is a good idea to always specify exact versions of critical stack components such as compilers, loaders, bundlers, and of course frameworks.\r\n\r\nThere are not that many of these tools in a single project and they do not tend to release more than once a week or so. This makes explicitly upgrading a relatively straightforward process.\r\n\r\nAlso, reading the changelogs for updates to such key dependencies is almost certainly something that one should be doing.\r\n\r\nThat said, I think it's fine to version more liberally. Each project is different in this regard.\r\n\r\n> The trade-off for getting millions of dollars of engineering investment in the TypeScript project is that marketing gets to control version numbers to a certain extent.\r\n\r\nThat _is_ a trade well worth making.\r\n\r\nFurthermore, TypeScript is by no means the only project that does this.\r\n\r\nI think any project that is high profile enough is likely subject to this, at least to some extent.\r\n\r\nEven if it is not the marketing department, it may be the maintainers' own self-consciousness that leads to such versioning.\r\n\r\n> Any time we produced the wrong type or emitted the wrong code or failed to issue a correct error, that's a breaking change, and we fix dozens of bugs like that in every release.\r\n\r\nTypeScript really releases at a blisteringly unprecedented pace for a programming language so I think this is somewhat inevitable. I also think it's common across almost all software. Minor versions of most software contain breaking changes, but they often go unnoticed. The more high-profile the project, the more users that has,  the more likely it is that this will be noticed.\r\n\r\nThe TypeScript team do an incredible job and they ship a wonderfully high quality product.", "meta": {"posReactions": "3", "negReactions": "0"}}
{"id": "COM6", "speaker": "gcnew", "conversation_id": "ROOT", "reply_to": "COM5", "timestamp": "2017-04-07T08:14:07Z", "text": "I can't agree with @aluanhaddad more. Personally, I think using language version 81 and browser version 127 is terrible. It looks ugly and these high numbers quickly become meaningless. In the browser case that's the intention - forcing consumers to update to the latest version. However, for a language it's out of place and makes following new features and important changes extremely hard. Every version, no matter how big or small, looks the same way as every other. Flow has fallen in that trap and it doesn't seem to reap many benefits out of it.\r\n\r\nFor TypeScript, if you still want automatic updates without worrying too much, just lock the minor version in and everything will fall into place.", "meta": {"posReactions": "3", "negReactions": "3"}}
{"id": "COM7", "speaker": "RyanCavanaugh", "conversation_id": "ROOT", "reply_to": "COM6", "timestamp": "2017-04-07T16:15:30Z", "text": "I mean, even semver's *own definition* of \"breaking change\" is arguably wrong. Minor updates can add new functionality under new properties, and new properties can break existing codepaths because JS is full of do-x-if-y-property-is-present patterns. Fixing a performance bug, which would in theory be a bugfix version update, could cause two async operations which previously always resolved in one order to instead always resolve in another order.\r\n\r\nIt is simply not the case that you can safely upgrade code, with semver *as used* today by normal package maintainers, from 34.1 of some library to 34.9 and be guaranteed that your program will still behave the same way.\r\n\r\nWhat semver means *in practice* is that the major version bump is \"You will probably need to update your code in a lot of places\", and the minor version bump is \"You should always be OK for the most part\". *TypeScript never makes updates of the first kind*. We only make compat-breaking changes where we believe you should always be OK modulo a small number of fixes we think you'll be happy making (because we found new bugs).\r\n\r\nWe're not going to take a major version bump because there was a bug in the compiler where it failed to identify early errors, even though that's technically a breaking change - we think you should be \"along for the ride\" on that one if you didn't shrinkwrap. That's how semver is used *in practice* by everyone anyway.", "meta": {"posReactions": "14", "negReactions": "10"}}
{"id": "COM8", "speaker": "eddieajau", "conversation_id": "ROOT", "reply_to": "COM7", "timestamp": "2017-06-15T04:14:36Z", "text": "Can we at least get a section on \"TypeScript and Semver\" added to the docs? The fundamental problem is that `npm install --save typescript` will add `\"typescript\":\"^2.4.0\" by default. Consumers need to be aware that this is dangerous and you need to change it to \"~2.4.0\" (tilde, not carat). I'm happy to do the PR if you can advise on where you want such information.\r\n\r\nBut for what it's worth:\r\n\r\n> \"You will probably need to update your code in a lot of places\" ... TypeScript never makes updates of the first kind.\r\n\r\nThe Promise changes in 2.4 **is** resulting in lots of little changes all over the place. I'm not saying I don't agree with the changes, but they are there nonetheless. I've been caught only because I've [wrongly] assumed that TypeScript was following Semver.\r\n", "meta": {"posReactions": "14", "negReactions": "0"}}
{"id": "COM9", "speaker": "daprahamian", "conversation_id": "ROOT", "reply_to": "COM8", "timestamp": "2017-06-21T16:16:17Z", "text": "I'd like to add a related question: should type definition files be compatible across all of 2.x.x? Can someone compile their library in 2.2, and have it work when someone pulls it in and compiles with 2.1?", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM10", "speaker": "DynConcepts", "conversation_id": "ROOT", "reply_to": "COM9", "timestamp": "2017-07-10T14:03:34Z", "text": "I too would prefer SemVer, and yes I know the majority of publishers are not \"doing it right\"...But lets look at an earlier comment:\r\n\r\n\"If we followed semver rules exactly, literally every single release would be a major version bump. Any time we produced the wrong type or emitted the wrong code or failed to issue a correct error, that's a breaking change, and we fix dozens of bugs like that in every release. \"\r\n\r\nWriting quality software is hard and requires investment. The above can be mitigated with improved testing and documentation.\r\n\r\nRemember the Agile principle: \"the art of maximizing the amount of work not done--is essential. \". This should *not* mean the amount of work done by a team to get something out the door. Rather it should be a global optimization to minimize the work required by all stakeholders globally and across type - the TOTAL work.\r\n\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM11", "speaker": "daprahamian", "conversation_id": "ROOT", "reply_to": "COM10", "timestamp": "2017-07-11T04:38:47Z", "text": "If it is not possible to follow semver, could we come up with some sort of way to enable backwards compatibility / legacy behavior in our code? I am currently dealing with two major issues that I view as breaking changes:\r\n\r\n# Consuming a library where the `.d.ts` files are compiled in TS version higher than my project.\r\n\r\nExample: Using TS 2.0, consuming a project that exports an interface with a member that is of type `object`.\r\n\r\nA few ideas on how to fix this:\r\n+ Allow TypeScript to compile to a previous version's output.\r\n+ Allow TypeScript to compile to multiple versions of types output, and then include a root file that routes the consuming compiler to the right definition using some sort of markup (comments, conditional compilation, etc.)\r\n\r\n# Consuming a library where the `.d.ts` files are compiled in a TS version lower than my project.\r\n\r\nSome examples include:\r\n\r\n+ https://github.com/Microsoft/TypeScript/issues/16536\r\n+ https://github.com/DefinitelyTyped/DefinitelyTyped/issues/17925\r\n+ https://github.com/ReactiveX/rxjs/pull/2722\r\n\r\nAll of these issues stem from stricter type checking introduced in a later version of TS. This could probably be mitigated by doing the following:\r\n1. Having `.d.ts` files contian the compiler version via comments\r\n2. Having the compiler check the imported code's compiler version, and only apply new/stricter rules if they existed in the compiled version.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM12", "speaker": "jsamr", "conversation_id": "ROOT", "reply_to": "COM11", "timestamp": "2017-11-23T16:13:17Z", "text": "And what about a new `package.json` property : `\"breaking\"` which values can be `\"MAJOR\"` (default), `\"MINOR\"` ?\r\nSee npm/npm#19231", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM13", "speaker": "FranklinYu", "conversation_id": "ROOT", "reply_to": "COM12", "timestamp": "2018-06-08T13:42:13Z", "text": "> Fixing a performance bug, which would in theory be a bugfix version update, could cause two async operations which previously always resolved in one order to instead always resolve in another order.\r\n\r\nIf the resolution order is *documented*, then indeed it is breaking change and should bump major version; otherwise it is *implementation details* and user is responsible for depending on this.", "meta": {"posReactions": "3", "negReactions": "0"}}
{"id": "COM14", "speaker": "calidion", "conversation_id": "ROOT", "reply_to": "COM13", "timestamp": "2019-02-06T16:38:32Z", "text": "@mhegazy You have my full support. Semver is evil. And should be rejected everywhere. Typescript is a very good example.", "meta": {"posReactions": "0", "negReactions": "11"}}
{"id": "COM15", "speaker": "eps1lon", "conversation_id": "ROOT", "reply_to": "COM14", "timestamp": "2019-02-06T17:24:52Z", "text": ">  Fixing a performance bug, which would in theory be a bugfix version update, could cause two async operations which previously always resolved in one order to instead always resolve in another order.\r\n\r\nThis is one of the go to arguments against SemVer and it's a classic strawman. The very first point of the SemVer spec invalidates the argument here that \"semvers own definition is wrong. here's why:\"\r\n\r\n> 1. Software using Semantic Versioning MUST declare a public API. This API could be declared in the code itself or exist strictly in documentation. However it is done, it should be precise and comprehensive.\r\n\r\nIf your public API declared that two operations resolve in a given order then, yes, a performance fix is probably a breaking change. However I don't know any library that declares two public functions **and** declares that one is always fast than the other.\r\n\r\nI agree if you don't have a public API then the SemVer is meaningless. However most of the issues with SemVer are a result of a problematic public API. Also https://xkcd.com/1172/: Just because a change breaks a workflow does not mean it is a SemVer breaking change if the public API never documented that workflow.", "meta": {"posReactions": "8", "negReactions": "1"}}
{"id": "COM16", "speaker": "calidion", "conversation_id": "ROOT", "reply_to": "COM15", "timestamp": "2019-02-07T02:45:51Z", "text": "Even with public apis, semver should never be applied.\r\nVersion update is a way to note software changes, not software compatibility.\r\nMain versions for architectural or big updates. Minor versions for small changes and new feature additions. Patch versions for bug fixes. Either one can break compatibility.\r\n\r\nSemver is stupid focusing on compatibility, which is nothing to do with versions.\r\n\r\nCompatibility should be maintained by developers and test cases.\r\n\r\nnpm is stupid in auto version updates which cause security issues and instability. The false assumption is originated from the idea semver bearing where versions should to be compatible within main version.", "meta": {"posReactions": "0", "negReactions": "8"}}
{"id": "COM17", "speaker": "calidion", "conversation_id": "ROOT", "reply_to": "COM16", "timestamp": "2019-02-07T02:47:50Z", "text": "Another principal should be never update until updates are fully tested.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM18", "speaker": "jsamr", "conversation_id": "ROOT", "reply_to": "COM17", "timestamp": "2019-02-07T07:22:10Z", "text": "> Compatibility should be maintained by developers and test cases.\r\n\r\nSo developers should test all the API surface they consume ? That is a big field.\r\nIn my opinion, they should test all the undocumented **assumptions** they are making on third party APIs. And of course, unexposed callpoints (classes and methods) they might use or inherit.\r\n\r\n> Fixing a performance bug, which would in theory be a bugfix version update, could cause two async operations which previously always resolved in one order to instead always resolve in another order.\r\n\r\nIf you are assuming the order in which those async tasks resolve, you are *Programming by Coincidence* (The Pragmatic Programmer, Ch. 6). This is a major flaw in your development process.\r\n**Breaking** in SemVer means **breaking the contract**, not your program. If your program doesn't fulfil its contract with an API, minor changes might well break it (*Design by Contract*). ", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM19", "speaker": "calidion", "conversation_id": "ROOT", "reply_to": "COM18", "timestamp": "2019-02-07T08:00:15Z", "text": "@jsamr No one can do that. \r\n\r\nNo one can 100% predict the process of the software development.\r\n\r\nSoftware development is more of a way of exploring than a process of promise keeping.\r\nIt is good to bear *Design by Contract* in mind and not to *Programming by Coincidence*.\r\nBut the real life is not functioning that way.\r\nYou even can't promise that your code is 100% correct. \r\nWhy you dear to say your updates are 100% compatible when you released a version?\r\n\r\nWe should respect *Design by Contract* and *Pragmatic Programmers*.\r\nAnd we should also know that we are human beings, who make mistakes and break promises. \r\nIt is the fact and reality. \r\nWe lives in reality not in illusion or theory.\r\n\r\nThe promise semver wants to keep breaks everyday and you still not wake up.\r\nWhy?\r\n\r\nDo you really know the difference between angular 2, 3, 4 and 5?\r\nDo you really care?\r\nWhy you care about the compatibility ? or you are simply driven by those people who propagating semver?\r\nWhy should update be compatible while you even don't write test cases?\r\nWhy should you update when no test is made ? Is that a pragmatic way?\r\n\r\nNever lie to yourself.\r\n\r\nTo keep compatibility is a very good practice, but to assume compatibility is a very stupid thought.\r\n\r\nFor major, minor, patch, all versions should try to keep compatibility.\r\nFor developers, should never trust compatibility.\r\n \r\n", "meta": {"posReactions": "0", "negReactions": "9"}}
{"id": "COM20", "speaker": "jsamr", "conversation_id": "ROOT", "reply_to": "COM19", "timestamp": "2019-02-07T09:02:59Z", "text": "@calidion I think we are misunderstanding each other.\r\n\r\nI have never claimed that *I can promise code is 100% correct*. However, a library author can aim at testing all the features exposed to consumers.\r\n\r\nHowever, it doesn't mean *there is 0 chance a minor upgrade will break the contract entitled by its authors*.\r\nSemantic versioning is, from a producer perspective, about expressing the contract and its retro-compatibility. Patches are here to correct a mismatch between the contract and its implementation.\r\n\r\nIt's **not**, from a consumer perspective, about neutralizing the risk of upgrading. I agree with you about testing upgrades, of course. Even better : put those tests in a pull request to library authors. If a test fails, they'll fix it and upgrade their patch version.\r\n\r\nYour argument is similar to refuting the utility of *Laws* because we can't promise it will be applied fairly to everybody. Do you have in mind a better system to address, **from a producer perspective**, the contract and retro-compatibility issues in library development? I don't, and that is why I find compliance with semantic versioning great.\r\n\r\nThe flaw in npm use of semantic versioning has been addressed with lockfiles. ", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM21", "speaker": "DynConcepts", "conversation_id": "ROOT", "reply_to": "COM20", "timestamp": "2019-02-07T14:42:49Z", "text": "If SemVer is to be of value only to the producer [i.e. the consumer can not base their actions reliability upon it] then what is the value of it even being exposed to the consumer????\r\n\r\nYes, I agree it is about contracts, but this leads to the discussion of what exactly is a contract that provides the value necessary to truly be useful to the consumer....  In my experience there are multiple orders of magnitude between what is typically produced as a contract [by the publisher] and what is needed by the consumer to determine the impact on their usage.\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM22", "speaker": "calidion", "conversation_id": "ROOT", "reply_to": "COM21", "timestamp": "2019-02-08T05:45:55Z", "text": "@jsamr \r\n\r\nSoftware won't get matured by merely contracts.\r\nIt is a much more complicated way.\r\n\r\nLike humans constantly violating laws,  software development will surely break contracts.\r\n\r\nSo it is stupid to believe in contracts.\r\n\r\nThere are police stations and courts for law violations.\r\nThere are no such things for software development and publishing.\r\n\r\nNo one wants to breaks compatibility, but it is inevitable even when semver is applied.\r\n\r\nIt's in fact not about contracts, It is about evolution which cannot be predicted precisely.\r\n\r\n\r\nAnother wrong believe is that updated should always be executed after software updates.\r\n\r\nNodejs has a service called green keeper which strengthens that wrong believe.\r\n\r\nSoftware quality is nothing to do with updates, newer updates maybe worse and mass things up.\r\n \r\nso updates should be applied when they are tested extensively not because they are newer.\r\n\r\nprogrammers should be selective to one stable version.\r\n\r\nFor example Ubuntu 16.04 is more stable than 17.04, 16.10, and even 18.04.\r\n\r\nWin 7 is more popular than win 8, win 10.\r\n\r\nThere are in fact no contracts, there are just releases.\r\n\r\n", "meta": {"posReactions": "0", "negReactions": "12"}}
{"id": "COM23", "speaker": "jsamr", "conversation_id": "ROOT", "reply_to": "COM22", "timestamp": "2019-02-08T07:37:15Z", "text": "@calidion It would be appreciable and civilized if you stopped calling the other's point of view &mdash; or the point of view you think they hold &mdash; \"stupid\". Just be decent and follow the community's rules. Even worse, you don't seem to try to understand the other side point of view, and rush to your own conclusions.\r\n\r\n@DynConcepts \r\n\r\n> [If] the consumer cannot base their actions reliability upon [semantic versioning], then what is the value of it even being exposed to the consumer?\r\n\r\nVery easy. Just imagine a version signature which has majors only, which would be equivalent to a standardless version signature (i.e., not semantic).\r\n\r\nYou need to upgrade a library from version `234 503` to `244 503` because this last version gives compatibility to a set of target platforms you need to integrate.\r\n\r\nBut you have no idea of the **intended** breaking changes by just looking at the signature. So you have to read the changelog from `234 503` to `244 503`, have fun!\r\n\r\nQuoting from the original specification:\r\n\r\n> Without compliance to some sort of formal specification, version numbers are essentially useless for dependency management. By giving a name and clear definition to the above ideas, **it becomes easy to communicate your intentions to the users of your software**.\r\n\r\nSemantic versioning is about **communicating**, nothing more.\r\n\r\n> Yes, I agree it is about contracts, but this leads to the discussion of what exactly is a contract that provides the value necessary to truly be useful to the consumer.... In my experience there are multiple orders of magnitude between what is typically produced as a contract [by the publisher] and what is needed by the consumer to determine the impact on their usage.\r\n\r\nI am certain this is an area of improvements, and this is why semantic versioning is only at [version 2.0.0](https://semver.org/) right now! To do so, we could explore different canonical unintended breaking changes between minors that happened in software history, where the interpretation of the contract was at stake. And from there, extrapolate a taxonomy of contracts and library purity.\r\n\r\nWhat I mean by library purity is close to purity in functional programming: if you only expose functions with no side effects, the library is *pure*. If your library instantiates a singleton in the global namespace, it is *unpure*. If it rely on non-javascript, environment-specific binaries, it is *environment-coupled*. But I am sure we could go way further in describing what could be called the **library footprint**.\r\n \r\nFrom that library footprint exposed to public knowledge, leveraging the impact of a library update would be easier.\r\n", "meta": {"posReactions": "13", "negReactions": "0"}}
{"id": "COM24", "speaker": "calidion", "conversation_id": "ROOT", "reply_to": "COM23", "timestamp": "2019-02-08T08:21:48Z", "text": "@jsamr \r\n\r\nYou move from **assumptions**,  **contracts** to **communicating**.\r\nBut you still don't realize the fact.\r\n\r\nScience and technologies draw principals from facts not from thinking, from what it is instead of what it should be.\r\n\r\nI think computer should based on decimal but it is binary.\r\n\r\nI think programs should be bug free but it will never be.\r\n\r\nIf the fact is ignored,  what is the value of finding communicating methods?\r\n\r\nSemver bears a good will, but it will never be a realistic one.\r\n\r\nA false good will always lead to a bad result. \r\n\r\nNpm's auto update has shown the downside and now lock fill has be introduced for remedy.\r\n\r\nI don't know why you still insist on use semver, what benefits do you gain on applying semver?\r\n\r\nGet sky high version number?\r\nMake versions meaningless?\r\nUpgrade major version on every small change that breaks?\r\nAuto updates that makes software unstable?\r\n\r\nI think there must be a list of gains if semver should be adopted.\r\n\r\n> I apologize for using `stupid` if it is offensive.\r\n\r\nSoftware quality will not be improve by merely defining very strict rules.\r\n\r\n\r\n\r\n\r\n", "meta": {"posReactions": "0", "negReactions": "11"}}
{"id": "COM25", "speaker": "jsamr", "conversation_id": "ROOT", "reply_to": "COM24", "timestamp": "2019-02-08T08:34:56Z", "text": "@calidion Perhaps the language barrier has an incidence, but I don't think you really grasp what I am attempting to express... If you want to continue this discussion, please drop a mail (see my profile to get the address).", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM26", "speaker": "justinfagnani", "conversation_id": "ROOT", "reply_to": "COM25", "timestamp": "2020-03-19T17:22:18Z", "text": "TypeScript not following semver has some serious negative implications in an ecosystem that builds a lot of features around the assumption that packages _do_ follow semver.\r\n\r\nSince npm installs libraries with a default version range that allows for newer minor versions, the command `npm i typescript` _will_ install an unstable and occaisionally breaking version of TypeScript. Collaborators on a project may get different versions when they install, and may get different sets of compiler errors. Fixing them for one developer may break things for another. Yes, projects should override the npm default, but they have to understand TypeScript's unusual versioning scheme in order to know to do so.\r\n\r\nEven worse, an upgrade to a new minor version of TypeScript may break users of a project. We don't have any indication through version numbers of which .d.ts files are compatible with which versions of TypeScript. A project that implicitly upgrades TypeScript to a breaking version due to breaks occurring at minor releases, builds, and publishes a new version with newer declaration files, will break consumers using an older version of TypeScript. Some users can't even choose their version due to the compiler being integrated into their build system / runtime (Angular, Storybook, TS-Node).\r\n\r\nBy adopting semver TypeScript would be a much better citizen in the npm ecosystem and reduce unintended breaks.", "meta": {"posReactions": "20", "negReactions": "1"}}
{"id": "COM27", "speaker": "calidion", "conversation_id": "ROOT", "reply_to": "COM26", "timestamp": "2020-03-19T17:49:11Z", "text": "It is semver's problem not typescript.\r\n\r\nsemver is the most misleading rule set ever.\r\n\r\nnpm's default rules make things worse.\r\n\r\nas now npm Inc. is sold to Microsoft, maybe we can see further advance in npm.\r\n\r\n", "meta": {"posReactions": "0", "negReactions": "14"}}
{"id": "COM28", "speaker": "treshugart", "conversation_id": "ROOT", "reply_to": "COM27", "timestamp": "2020-03-20T04:32:03Z", "text": "How is semver misleading?", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM29", "speaker": "calidion", "conversation_id": "ROOT", "reply_to": "COM28", "timestamp": "2020-03-20T07:13:59Z", "text": "Semver is like some idiots claim that all human are straight,  never know of LGBT.", "meta": {"posReactions": "0", "negReactions": "9"}}
