{"id": "ROOT", "speaker": "enragedginger", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-01-29T16:42:45Z", "text": "Rename \"taint\" to something less vulgar **What would you like to be added**:\r Rename \"taint\" to something less vulgar.\r \r **Why is this needed**:\r In common English, a taint is an area in the nether regions of the human body. This makes discussing Kubernetes \"taints\" very difficult in a professional or public setting, especially if anyone who doesn't already know of Kubernetes \"taints\" is present.\r \r We should rename \"taint\" to be either \"perineum\", the official name for the taint, or something more fitting like \"restriction\" or \"stigma.\"", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM0", "speaker": "enragedginger", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-01-29T16:51:08Z", "text": "/sig docs", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM1", "speaker": "neolit123", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2020-01-29T20:48:43Z", "text": "it might be too late for this one, without breaking thousands of users.\r\nbut \"taint\" in general is already used in computing and i don't think many people have a problem with that.\r\n\r\n/sig architecture node\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM2", "speaker": "enragedginger", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2020-01-29T23:57:10Z", "text": "I don't agree with that rationale. I think we can all agree that we should avoid using vulgarities in our code, documentation, and general professional communication. Regardless of whether or not the word was once accepted in computation, it is now a common vulgarity. Therefore, we should move away from it. Doing so will only increase the appeal of Kubernetes by making it appear more mature and forward thinking.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM3", "speaker": "smarterclayton", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2020-01-30T00:38:43Z", "text": "Thanks for the feedback.  Since these issues historically attract a lot of unhelpful arguments and attacks in the threads, I'm going to lock this issue for now and when we add this to sig-architecture agenda I'll update with details for discussion there.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM4", "speaker": "smarterclayton", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2020-01-30T18:36:43Z", "text": "I'll bring this up at the sig-arch meeting today, however as neolit noted \r\n\r\n* our API guarantees prevent these sorts of renames on short time scales (we might introduce a new name, but the old name would be preserved effectively for the rest of the v1 lifetime)\r\n* the term is well established in both having common descriptive usage (outside of the less-common vulgar usage)\r\n\r\nso I think it's unlikely we would change this.  Will update after the meeting.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM5", "speaker": "timothysc", "conversation_id": "ROOT", "reply_to": "COM4", "timestamp": "2020-01-30T19:07:28Z", "text": "I'm opposed to the change at this stage due to the overall impact it would have, there is plenty of history and literature that does not pertain to the urban-dictionary definition. ", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM6", "speaker": "liggitt", "conversation_id": "ROOT", "reply_to": "COM5", "timestamp": "2020-01-30T19:14:36Z", "text": "Agreed. A rename at this point is not practical due to API compatibility guarantees, and the term as used corresponds to the legitimate and inoffensive definition of the word.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM7", "speaker": "timothysc", "conversation_id": "ROOT", "reply_to": "COM6", "timestamp": "2020-01-30T19:16:37Z", "text": "We discussed this issue on the SIG-arch call of 20200130, and have unanimously agreed that we will keep the current naming for the aforementioned reasons. ", "meta": {"posReactions": "0", "negReactions": "0"}}
