{"id": "ROOT", "speaker": "ghost", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2019-07-11T14:34:28Z", "text": "Norton very unhappy with vcpkgmetricsuploader I just installed the current vcpkg and encountered this as well. I've read through [#6551](https://github.com/microsoft/vcpkg/issues/6551) and [#3345.](https://github.com/microsoft/vcpkg/issues/3345) I see these closed but don't see any resolution.\r \r What I do see is that Norton is very, very unhappy on my system with this tool. I've gotten SONAR reports about the metrics upload (and I'll also put in a vote for making metrics opt-in. I'm surprised that it is opt-out, and not terribly well documented opt-out). Norton is now saying that it needs to restart to finish cleaning out the security risks.\r \r This is not the level of security awareness I expect Microsoft to have. Minimally fix this to be opt-in. Beyond that, work with your security teams to get the uploader qualified by at least the major vendors.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM0", "speaker": "heydojo", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2019-07-15T03:43:34Z", "text": "> This is not the level of security awareness I expect Microsoft\r\n\r\nI don't work for MS. Your tone is derogatory.\r\n\r\nYour software (Norton) has established a false positive in it's threat detection. Please work with the software manufacturer to establish a resolution on their part.\r\n\r\nThere is nothing Microsoft or anyone else can do if a piece of third party software on your machine malfunctions.\r\nOne solution is to use Windows built-in threat detection tools instead of the unreliable Norton software. I am actually quite shocked that Norton are even still in business. Their AV and other \"Security\" products have been malfunctioning and underperforming for well over 20 years.\r\n\r\nBecause vcpkg is open source, you can modify the source code any way that you wish once you have obtained a copy locally, so I'm unsure what else to say other than it would appear that the software Norton have sold you is not providing you value for money and is also causing you frustration instead as well.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM1", "speaker": "ghost", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2019-07-15T05:02:56Z", "text": "As I pointed out this has been reported repeatedly in the past, and closed with no explanation or correction.  Specifically, #3345 is clear that it is much more widespread.  I'd focus less on Norton, per se, based on these prior reports.\r\n\r\nThe initial issue is the issuance of telemetry without opt-in.  It is, in fact, that telemetry that is causing the image to be considered suspect.\r\n\r\nFurthermore, vcpkg is recommended by Microsoft (e.g. see https://docs.microsoft.com/en-us/cpp/build/vcpkg?view=vs-2019 as an example).  I was, and am, surprised that Microsoft is recommending a solution that performs telemetry by default.  And one that does not have a clear statement that it is taking telemetry, exactly what telemetry it is taking, and does not have a very clear opt-out.\r\n\r\nNow, can I fork the code to do whatever I want?  Sure.  Can I propose a fix?  Sure. Does that change the surprise at the telemetry by default and the lack of visibility, or that this has been reported for over a year?  Not really.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM2", "speaker": "ghost", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2019-07-19T02:18:29Z", "text": "There are several options you may try to solve the problem:\r\n1. Run the bootstrap process with the \".\\boostrap-vcpkg.bat -disableMetrics\"  option to compile vcpkg without metrics.\r\n2. Tell Norton not to scan the vcpkg.exe executable\r\n3. Tell Norton not to scan the directory/folder containing vcpkg.exe\r\n\r\n", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM3", "speaker": "ghost", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2019-07-20T04:51:25Z", "text": "My workaround was to tell Norton to reverse the quarantine decision and to not scan the metrics upload image.\r\n\r\nMaybe I'm the only person bothered by the opaque decision to have this process upload data from my machine to some remote site.  But I am bothered by it.\r\n\r\nI can surely support a \".\\bootstrap-vcpkg.bat -enableMetrics\" approach.  Or an approach that directly asks at the start of the bootstrap process if I want to upload metrics and either directly disclose, or be able to disclose, what will be uploaded.\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM4", "speaker": "heydojo", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2019-07-22T11:26:20Z", "text": "@JEJ0 \r\n\r\nhttps://github.com/microsoft/vcpkg/blob/7d72108b9a09e92342ff695c074766fb068049df/docs/about/privacy.md\r\n\r\n>  I'd focus less on Norton, per se, based on these prior reports.\r\n\r\nThis is the incorrect approach based upon your issue.\r\n\r\nBecause:\r\n\r\n> Your software (Norton) has established a false positive in it's threat detection.\r\n\r\nAnd one single other bug report:\r\n\r\n> Specifically, #3345 is clear that it is much more widespread.\r\n\r\nDoes not validate your position. Your logic fails to accommodate the fact that AV software (especially badly maintained, poorly coded AV software) is highly prone to false positive detection rates. The simple solution since the false positive problem was identified (decades ago) has been to report the false positive to the manufacturer using (commonly) their automatic reporting tool.\r\nI have already suggested that you do this and yet you persist to assert that your problem is one of Microsoft's making.\r\n\r\n>  I was, and am, surprised that Microsoft is recommending a solution that performs telemetry by default.\r\n\r\nI'm sorry but if you were unaware, telemetry by default is how Windows 10 is shipping too. It is the default position of Microsoft products to do so.\r\nIf you do not like this behaviour (and I personally find it repugnant) then turn it off. The method to do so, as already mentioned is `-disableMetrics`.\r\n\r\n> Now, can I fork the code to do whatever I want? Sure. Can I propose a fix? Sure.\r\n\r\nBoth rhetorical questions.\r\n\r\n> Does that change the surprise at the telemetry by default and the lack of visibility, or that this has been reported for over a year?\r\n\r\nAnd yet according to your report:\r\n\r\n> This is not the level of security awareness I expect Microsoft to have.\r\n\r\nPlease don't attempt to change the topic of this thread. We get it. You don't like metrics.\r\nFalse positive detections by AV products have nothing to do with Microsoft's level of security awareness. You can report false positives to AV product manufacturers. And you can also turn off vcpkg's metrics using a single switch. This in turn should prevent the false positive triggering.\r\n\r\nLet us know how you get on.\r\nThanks.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM5", "speaker": "Rastaban", "conversation_id": "ROOT", "reply_to": "COM4", "timestamp": "2019-07-23T00:18:56Z", "text": "It is annoying that Norton flags the metrics uploader, but at this time there is no solution that works for the team at this time.  The uploader cannot be qualified by the major anti-virus vendors because it is built on the end users machine and is not signed.  We have discussed fiddling with the implementation of the uploader, but have decided against it because we don't want to obfuscate the code.  Also tricks that may work now could end up backfiring later.  Making the metrics uploader opt-in rather than opt-out does not solve the anti-virus issue either, it only makes it less noticeable.\r\n\r\nIn response to your concerns of the collection of usage metrics, I refer you to the privacy policy: https://github.com/Microsoft/vcpkg/blob/master/docs/about/privacy.md.", "meta": {"posReactions": "0", "negReactions": "0"}}
