{"id": "ROOT", "speaker": "SIkebe", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-10-01T13:40:47Z", "text": "The Future of IdentityServer >The current version (IdentityServer4 v4.x) will be the last version we work on as free open source. We will keep supporting IdentityServer4 until the end of life of .NET Core 3.1 in November 2022.\r >\r >To continue our work, we have formed a new company Duende Software, and IdentityServer4 will be rebranded as Duende IdentityServer. Duende IdentityServer will contain all new feature work and will target .NET Core 3.1 and .NET 5 (and all versions beyond).\r https://leastprivilege.com/2020/10/01/the-future-of-identityserver/\r \r Currently, some of the ASP.NET Core templates use IdentityServer4. How the above announcement affect? ASP.NET Core 5.0 will be shipped with IdentityServer4?", "meta": {"posReactions": "13", "negReactions": "0"}}
{"id": "COM0", "speaker": "blowdart", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-10-01T15:22:12Z", "text": ".NET 5.0 will ship with IdentityServer 4 in some ASP.NET templates. As the IS folks have stated\r\n\r\n> We will keep supporting IdentityServer4 until the end of life of .NET Core 3.1 in November 2022.\r\n\r\nPlanning has begun for .NET 6.0 and we'll make an announcement when ready.", "meta": {"posReactions": "20", "negReactions": "1"}}
{"id": "COM1", "speaker": "Aaronontheweb", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2020-10-01T17:38:37Z", "text": "I don't see why this is a big deal - still fine for ASP.NET Core to ship OSS templates that include IdentityServer4 under this license. If companies want great tools for solving problems as complicated and critical as identity management they should have no problem paying for it.", "meta": {"posReactions": "20", "negReactions": "5"}}
{"id": "COM2", "speaker": "weedkiller", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2020-10-01T17:40:59Z", "text": "We need a new free option, this is a core component and cannot be outsourced to 3rd party companies.\r\n\r\n**THIS IS TOO CRITICAL**", "meta": {"posReactions": "10", "negReactions": "55"}}
{"id": "COM3", "speaker": "Aaronontheweb", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2020-10-01T17:46:30Z", "text": "> We need a new free option, this is a core component and cannot be outsourced to 3rd party companies.\r\n\r\nIf you've been using IdentityServer all this time, you've already been depending on a 3rd party company. OSS software isn't about other people doing things for you for free - either roll your own, pick another technology, or pay the bill. \r\n\r\nIf you can't afford $1500 a year for IdentityServer4 to manage something as critical as identity for your business applications, drop them a line and let them know - pricing software products is a complicated business.", "meta": {"posReactions": "46", "negReactions": "2"}}
{"id": "COM4", "speaker": "isaacabraham", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2020-10-01T17:57:30Z", "text": "IS4 will actually remain free and will be supported in line with .NET Core 3.1. It's only IS5 (as far as I'm aware) that will be commercial.\r\n\r\nBut the main point is right - if you don't want to pay for the future version of IS, just use the out of the box solution or roll your own. If you would rather not take on that responsibility and / or it'll be quicker to use a third-party package written by experts, then you can pay for them to do it for you.\r\n\r\nI don't see the problem.", "meta": {"posReactions": "21", "negReactions": "6"}}
{"id": "COM5", "speaker": "citizenmatt", "conversation_id": "ROOT", "reply_to": "COM4", "timestamp": "2020-10-01T18:13:07Z", "text": "> .NET 5.0 will ship with IdentityServer 4 in some ASP.NET templates. As the IS folks have stated\r\n> \r\n> > We will keep supporting IdentityServer4 until the end of life of .NET Core 3.1 in November 2022.\r\n> \r\n> Planning has begun for .NET 6.0 and we'll make an announcement when ready.\r\n\r\nCan you link to the issue where this is being discussed, please?", "meta": {"posReactions": "3", "negReactions": "0"}}
{"id": "COM6", "speaker": "hhariri", "conversation_id": "ROOT", "reply_to": "COM5", "timestamp": "2020-10-01T18:13:10Z", "text": "@weedkiller Funny how while it's been free, depending on 3rd parties has never been a problem...", "meta": {"posReactions": "33", "negReactions": "3"}}
{"id": "COM7", "speaker": "blowdart", "conversation_id": "ROOT", "reply_to": "COM6", "timestamp": "2020-10-01T19:49:01Z", "text": "@citizenmatt \"we'll make an announcement when ready\"", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM8", "speaker": "SIkebe", "conversation_id": "ROOT", "reply_to": "COM7", "timestamp": "2020-10-02T01:04:50Z", "text": "@blowdart Thank you for your clarification!", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM9", "speaker": "citizenmatt", "conversation_id": "ROOT", "reply_to": "COM8", "timestamp": "2020-10-02T08:00:50Z", "text": "> @citizenmatt \"we'll make an announcement when ready\"\r\n\r\nDoes \"we\" mean Microsoft, the .NET Foundation or the open source community?", "meta": {"posReactions": "11", "negReactions": "0"}}
{"id": "COM10", "speaker": "weedkiller", "conversation_id": "ROOT", "reply_to": "COM9", "timestamp": "2020-10-02T19:51:05Z", "text": "@hhariri It used to be core part of the MS Stack back in early webforms/MVC time frames. However MS did not release the comparable component with an admin/UI, in the new ASP stack. So people gravitated towards that as a viable and that it was a free option.\r\n\r\n**From a financial point** 1500$ in countries where they make less than 3$/day is not an option and a pain of the smaller business that you should personally exp. to understand. Many of these sites just have basic features enabled, with a large community\r\n\r\nAlso with this kind of a mindset other competing products like Wordpress on PHP have gained huge ground on ASP. Some day PHP and its frameworks are going to catch up.\r\n\r\nLook at the search results, there are several several questions and issues just on this topic which are closed or unanswered with a heavy hammer. for e.g. 57 votes ASP identity  -- https://github.com/dotnet/aspnetcore/issues/16534 https://github.com/dotnet/aspnetcore/issues/973 \r\n\r\n_________________________\r\nLooking through the issues..\r\n\r\n**there are several pertinent questions that are core to the stack, that are simply too hard for a developer to tackle on his own**, and too crucial for any one to monopolize.\r\n\r\n### Multi tenancy, Dynamic Roles with claims, Federation, SSO, ASP Identity Core is DB facing more that anything, Open ID integration and more\r\n\r\n@citizenmatt _please_ give us an option that's doesn't burn a hole! ", "meta": {"posReactions": "11", "negReactions": "0"}}
{"id": "COM11", "speaker": "weedkiller", "conversation_id": "ROOT", "reply_to": "COM10", "timestamp": "2020-10-02T19:57:01Z", "text": "> IS4 will actually remain free and will be supported in line with .NET Core 3.1. It's only IS5 (as far as I'm aware) that will be commercial.\r\n> \r\n> But the main point is right - if you don't want to pay for the future version of IS, just use the out of the box solution or roll your own. If you would rather not take on that responsibility and / or it'll be quicker to use a third-party package written by experts, then you can pay for them to do it for you.\r\n> \r\n> I don't see the problem.\r\n\r\nFrom what I gathered their site earlier this week, its free only till IS 4.x (current version). Everything going forward is Duende or something software and costs money from October, so they way I understand any development from here.. is commercial including bug fixes etc.", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM12", "speaker": "bladefist", "conversation_id": "ROOT", "reply_to": "COM11", "timestamp": "2020-10-02T20:15:24Z", "text": "IS4 will work until 2022 at that point you won't able to get security fixes, etc.  They went enterprise pricing, there is no hobby pricing or \"starter\".   They went from 0 to 60.  It's ok, it's their choice, but we have a choice too.  Before we migrate to one of the other FOSS systems we're waiting for Microsofts response to this.  Surely this is a pivot moment to solve this internally  for the framework.  MVC1-5 came with auth solutions so I expect they will continue that tradition. \r\n\r\nJson parsing used require 3rd party (at least if you wanted performance).  That's internal now and far better.  We'll see what they do. ", "meta": {"posReactions": "6", "negReactions": "0"}}
{"id": "COM13", "speaker": "adamhathcock", "conversation_id": "ROOT", "reply_to": "COM12", "timestamp": "2020-10-02T20:25:15Z", "text": "A full OpenID Provider has been built in.  Not sure why it's considered necessary to have it now.\n\nI get that IdentityServer going non-free sucks for some users but there are alternatives like OpenIDdict.\n\nBegging Microsoft to make things like this distracts them from improving core functionality.  Microsoft doesn't have to own everything dotnet.", "meta": {"posReactions": "11", "negReactions": "2"}}
{"id": "COM14", "speaker": "pollumi", "conversation_id": "ROOT", "reply_to": "COM13", "timestamp": "2020-10-03T08:34:09Z", "text": "I get it that the creators need money so it is their decision whatever they want to do.\r\n\r\nFor the .net ecosystem it is a rather disastrous event. As a small company that has chosen IdentityServer because it is the \"official\" framework of choice, both according to Microsoft and the general community, you are now facing a lot of not needed and not wanted problems. Sure you can say, yes $1500 is not much in the business environment. But this is not true for all of them. For us it is a lot of money and also a lot of time that we have already invested. We now have to migrate to something different.\r\nIn a healthy ecosystem, it should not happen that a pillar on which so many have built, changes the license so negatively. \r\n\r\nYes, open source is not about \"free work\" but you clearly want to have a .net ecosystem with all the basic tools that keep steady and have a very open license. It would have been better if they did the license change back then when they converted IdentityServer to .net core.", "meta": {"posReactions": "9", "negReactions": "0"}}
{"id": "COM15", "speaker": "robertwt7", "conversation_id": "ROOT", "reply_to": "COM14", "timestamp": "2020-10-03T11:38:06Z", "text": "> Begging Microsoft to make things like this distracts them from improving core functionality. Microsoft doesn't have to own everything dotnet.\r\n\r\nMost of full stack framework out there has official package for crucial things like this (say laravel). Coming from other communities like php, node, etc, dev can build and experiment with everything totally free. This makes it harder for newcomers to learn aspnet core without the support from the community or microsoft officially\r\n\r\nEdit: and yes its totally up to the creators if that's their decision\r\n", "meta": {"posReactions": "4", "negReactions": "0"}}
{"id": "COM16", "speaker": "isaacabraham", "conversation_id": "ROOT", "reply_to": "COM15", "timestamp": "2020-10-03T11:48:47Z", "text": "> For the .net ecosystem it is a rather disastrous event.\n\n> In a healthy ecosystem, it should not happen that a pillar on which so many have built, changes the license so negatively. \n\nHere are some alternatives that may have come to pass without this move :\n\n1. They stop developing identity server completely as it's not financially viable for them to continue it. \n\n2. Support and ongoing changes dry up. You have a live issue and there's no one to help you out.\n\nAlso consider the difference now : The team may have more funds to invest in making the API and docs even better, saving you time and money.\n\nIn other words, positioning this as a negative move is perhaps a little short sighted. The current situation was probably unsustainable and this was no surprise to me when I saw the news.\n\nYou have until the end of life of netcore 31 which is next year, to plan for a migration strategy. As I understand it, IS4 will continue to work, it's simply not going to be updated.\n\nI suspect that the time saving of paying the money will outweigh the cost of moving but you will undoubtedly know better.\n\n", "meta": {"posReactions": "6", "negReactions": "3"}}
{"id": "COM17", "speaker": "adamhathcock", "conversation_id": "ROOT", "reply_to": "COM16", "timestamp": "2020-10-03T12:19:02Z", "text": "> > Begging Microsoft to make things like this distracts them from improving core functionality. Microsoft doesn't have to own everything dotnet.\n> \n> \n> \n> Most of full stack framework out there has official package for crucial things like this (say laravel). Coming from other communities like php, node, etc, dev can build and experiment with everything totally free. This makes it harder for newcomers to learn aspnet core without the support from the community or microsoft officially\n> \n> \n> \n\nIt's just one project changing a license.  Yes, it's popular but there are alternatives.  This happens in all ecosystems. They also have paid for things too.\n\nThe sky isn't falling.", "meta": {"posReactions": "8", "negReactions": "5"}}
{"id": "COM18", "speaker": "Aaronontheweb", "conversation_id": "ROOT", "reply_to": "COM17", "timestamp": "2020-10-03T16:18:08Z", "text": "> Sure you can say, yes $1500 is not much in the business environment. But this is not true for all of them. For us it is a lot of money and also a lot of time that we have already invested. We now have to migrate to something different.\r\n> In a healthy ecosystem, it should not happen that a pillar on which so many have built, changes the license so negatively.\r\n\r\nHaving sustainable OSS projects _is_ part of a healthy ecosystem. If not $1500, what amount would you pay?\r\n\r\nIf the answer is \"none\" then _you're the problem_.", "meta": {"posReactions": "25", "negReactions": "8"}}
{"id": "COM19", "speaker": "jbogard", "conversation_id": "ROOT", "reply_to": "COM18", "timestamp": "2020-10-03T17:08:23Z", "text": "If you're hosting on Azure, you might look at its [Easy Auth feature for App Services](https://docs.microsoft.com/en-us/azure/app-service/overview-authentication-authorization). That's free, too. We use that quite a lot for the \"easy\" scenarios. If your situation is complex, that's when you need something more powerful, and I don't see why it must be free.", "meta": {"posReactions": "7", "negReactions": "0"}}
{"id": "COM20", "speaker": "isaacabraham", "conversation_id": "ROOT", "reply_to": "COM19", "timestamp": "2020-10-03T17:25:43Z", "text": "In fact you have until end of 2022 to move over. That's two years. ", "meta": {"posReactions": "2", "negReactions": "3"}}
{"id": "COM21", "speaker": "leastprivilege", "conversation_id": "ROOT", "reply_to": "COM20", "timestamp": "2020-10-03T17:52:58Z", "text": "@weedkiller @bladefist (and everyone else)\r\n\r\nAs @Aaronontheweb says, pricing a product is hard. If you want to give us feedback on the pricing and explain your situation, this is not the right place to do that.\r\n\r\nPlease contact us directly\r\nhttps://duendesoftware.com/contact\r\n\r\nthanks!", "meta": {"posReactions": "20", "negReactions": "2"}}
{"id": "COM22", "speaker": "HassanHashemi", "conversation_id": "ROOT", "reply_to": "COM21", "timestamp": "2020-10-03T21:32:58Z", "text": "> Most of full stack framework out there has official package for crucial things like this (say laravel). Coming from other communities like php, node, etc, dev can build and experiment with everything totally free. This makes it harder for newcomers to learn aspnet core without the support from the community or microsoft officially.\r\n\r\nTotally true, identity and access management should be baked into the framework as it is needed in almost any serious app.", "meta": {"posReactions": "3", "negReactions": "0"}}
{"id": "COM23", "speaker": "pollumi", "conversation_id": "ROOT", "reply_to": "COM22", "timestamp": "2020-10-03T21:42:44Z", "text": "> > Sure you can say, yes $1500 is not much in the business environment. But this is not true for all of them. For us it is a lot of money and also a lot of time that we have already invested. We now have to migrate to something different.\r\n> > In a healthy ecosystem, it should not happen that a pillar on which so many have built, changes the license so negatively.\r\n> \r\n> Having sustainable OSS projects _is_ part of a healthy ecosystem. If not $1500, what amount would you pay?\r\n> \r\n> If the answer is \"none\" then _you're the problem_.\r\n\r\nSorry, but this is just an arrogant statement by you.\r\nI absolutely don't want to pay anything extra (yearly!!) for such a **very basic** thing like identity in my framework. \r\nAgain, I completely get that the IS devs neeed more money and want to be paid. But I (and a lot of other not so high profile devs like you) invested a lot of time into using this product since MS declared it the defacto standard. \r\nI don't expect some - again VERY BASIC - functionality in my tech stack to change the licence 180°. This is an absolutely not planned change that cost a lot of time and money. If this was a framework that helps solving some black magic math issues, I wouldn't have such problems. But we absolutely need fully FOSS solutions for the very basic things in every day life. And I don't agree that MS should't fill this gap here. It was their mistake to promote IS in the first place without making sure that it keeps the same license **forever**.", "meta": {"posReactions": "4", "negReactions": "9"}}
{"id": "COM24", "speaker": "Aaronontheweb", "conversation_id": "ROOT", "reply_to": "COM23", "timestamp": "2020-10-03T21:55:34Z", "text": "> I absolutely don't want to pay anything extra (yearly!!) for such a very basic thing like identity in my framework.\r\n\r\nYou don't need something as sophisticated as IS4/5 for simple use cases - there are numerous other libraries that are free. We're using `Microsoft.AspNetCore.Identity` in our application, which is already built in and matches your requirements exactly.", "meta": {"posReactions": "7", "negReactions": "5"}}
{"id": "COM25", "speaker": "poke", "conversation_id": "ROOT", "reply_to": "COM24", "timestamp": "2020-10-03T22:00:32Z", "text": "> I absolutely don't want to pay anything extra (yearly!!) for such a very basic thing like identity in my framework.\r\n\r\n1. You're not paying anything right now to begin with. The framework and platform is already free to use. And you're likely making money from it.\r\n2. IdentityServer is only tangentially related to Identity management. It's an identity provider which is still a special thing you likely don't want to put into every other app.\r\n3. Identity management itself is built into the framework with ASP.NET Identity. That is completely unrelated to what IdentityServer offers though except that it integrates well into ASP.NET Identity.\r\n4. Other platforms actually often don't have solutions like IdentityServer, especially not built-in. A common alternative that I know of is Keycloak (which you can easily use for your .NET apps as well).\r\n5. There are other alternatives to building your own identity provider. In Azure, you could use Azure AD. On-premise you have ADFS. And you can also use free third-party services like Auth0 or just integrate other identity providers directly.\r\n5. If you absolutely need to ship your own identity provider, realize the complexity this involves (auth is a complex thing to master!) and consider paying for a license.\r\n6. You can also check out OpenIddict if you need an open (free) implementation. But who knows whether that will always stay free to use. ", "meta": {"posReactions": "5", "negReactions": "4"}}
{"id": "COM26", "speaker": "pollumi", "conversation_id": "ROOT", "reply_to": "COM25", "timestamp": "2020-10-03T22:49:53Z", "text": "> > I absolutely don't want to pay anything extra (yearly!!) for such a very basic thing like identity in my framework.\r\n> \r\n> You don't need something as sophisticated as IS4/5 for simple use cases - there are numerous other libraries that are free. We're using `Microsoft.AspNetCore.Identity` in our application, which is already built in and matches your requirements exactly.\r\n\r\nWe have 2020 and those features should be something that should be absolutely solved **in a standardized way** and freely available in a famework:\r\n- Access token creation with including custom claims\r\n- Refreshtoken creation and presistence\r\n- Everything needs to be easily scalable to multiple instances. \r\n- Storage of credentials should be easily customizable.\r\n\r\nAgain, the point here is that we invested time and money in solutions using IS for those things. Because MS said this is the way to go. \r\n\r\nWe are still in a crucial situation with .net and hoping that it gain more ppl using it. Also if Blazor should gain traction something like this just doesn't help. ", "meta": {"posReactions": "5", "negReactions": "1"}}
{"id": "COM27", "speaker": "clooge", "conversation_id": "ROOT", "reply_to": "COM26", "timestamp": "2020-10-03T22:55:58Z", "text": "> \r\n> \r\n> I get it that the creators need money so it is their decision whatever they want to do.\r\n> \r\n> For the .net ecosystem it is a rather disastrous event. As a small company that has chosen IdentityServer because it is the \"official\" framework of choice, both according to Microsoft and the general community, you are now facing a lot of not needed and not wanted problems. Sure you can say, yes $1500 is not much in the business environment. But this is not true for all of them. For us it is a lot of money and also a lot of time that we have already invested. We now have to migrate to something different.\r\n> In a healthy ecosystem, it should not happen that a pillar on which so many have built, changes the license so negatively.\r\n> \r\n> Yes, open source is not about \"free work\" but you clearly want to have a .net ecosystem with all the basic tools that keep steady and have a very open license. It would have been better if they did the license change back then when they converted IdentityServer to .net core.\r\n\r\n@pollumi I agree with everything you said 💯 this is a pretty core function to the Microsoft Stack, had they done it right in the first place it would have never been issue today.\r\n\r\nAlso @Aaronontheweb is out of line with personal comments like that. What an idi0t, not ok, just because he dont agree with someone else view.\r\n\r\nWhy is this closed?!", "meta": {"posReactions": "5", "negReactions": "0"}}
{"id": "COM28", "speaker": "jbogard", "conversation_id": "ROOT", "reply_to": "COM27", "timestamp": "2020-10-03T23:18:20Z", "text": "If folks wanted this to be free, perhaps they should petition MS to sponsor the project at a level that would ensure that?", "meta": {"posReactions": "10", "negReactions": "0"}}
{"id": "COM29", "speaker": "hallidev", "conversation_id": "ROOT", "reply_to": "COM28", "timestamp": "2020-10-04T00:02:17Z", "text": "I just want to throw my hat in because I keep seeing the $1500 number over and over in this and other threads, but I can't see how this would apply to anything but the absolute most basic IS4 implementation.\r\n\r\nI'm putting together a solution that uses IdentityServer4 for a relatively small startup. We don't have a problem paying to support the project, which is what we thought we were doing when we paid for the Enterprise AdminUI license at $8400 / year:\r\n\r\nhttps://www.identityserver.com/products/adminui\r\n\r\nThis was a stretch for us, but we chose it over similar open source projects like https://github.com/skoruba/IdentityServer4.Admin to financially support the IS4 project.\r\n\r\nThe per-client licensing model of Duende IdentityServer is what's going to make this untenable for us going forward. Let me describe our clients:\r\n\r\n1: AdminUI (which alone is $8400 / year)\r\n2: AdminUI Webhooks\r\n3: Delegation gateway 1 (https://docs.identityserver.io/en/dev/topics/extension_grants.html)\r\n4: Delegation gateway 2 (different use case, same idea. Can't be the same client)\r\n5: Worker service 1\r\n6: Worker service 2\r\n7: Worker service 3\r\n\r\n...\r\n\r\nAs you can see, we've used 7 clients (2 of which are required by the IS4-affiliated product we're already paying thousands a year for) before even getting to the part where a single actual website or mobile app exists. \r\n\r\nWorker services (client credentials grants) come online at an alarming rate, and they're generally dead-simple pieces of code, sometimes the entire service is 100 lines of code.\r\n\r\nI don't know how other shops are handling IS4 clients, but using Duende IdentityServer will immediately put us in the Enterprise tier at $12,000 / year, putting our total cost at over $20k / year. \r\n\r\nI wanted to point all of this out since people may read these threads thinking \"I can swing $1500 / year\". I'd be shocked to find out that our setup was unique in the number of clients that end up being created. This client based pricing model is going to immediately price out many startups like the one I'm working with.\r\n\r\nThe IS4 authors deserve to be well compensated and I hope Duende IdentityServer is a success for their sake, but I'm also hoping they introduce something like a per-user pricing model.", "meta": {"posReactions": "10", "negReactions": "0"}}
