{"id": "ROOT", "speaker": "NebelNidas", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-02-22T10:38:44Z", "text": "feat: Allow custom file extensions ## Summary\r As discussed in #4182, I'd like to request the addition of the \"override_ext\" front matter tag.\r \r ## Motivation\r I'm using php code on my website, like many others, too. I can create a \"test.php\" file, and the generated file will have the \".php\"-extension, all right. However, I want to use markdown for my blog posts, and these \".md\" files are automatically generated to \".html\" files! And because the posts have a .\"php\" layout with php code, but the file ends up as html, the site does not work. OK, I could create a permalink as suggested in the issue linked above, but that's a bad workaround because I don't want to hardcode the file name and directory.\r A similar request has been discussed already, but I find the [excuses](https://github.com/jekyll/jekyll/issues/5646#issuecomment-357329996) quite weak. As of now, it's hardcoded for markdown files to be converted to html files, and that's simply not right. Give us an option here!\r \r Edit: OK, it's not really needed for other files where I can already set my custom extension manually, this would just add more confusion. But for all files which jekyll automatically converts into a hardcoded format, this should be changeable - most likely in config.yml.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM0", "speaker": "jekyllbot", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-04-22T11:10:18Z", "text": "\nThis issue has been automatically marked as stale because it has not been commented on for at least two months.\n\nThe resources of the Jekyll team are limited, and so we are asking for your help.\n\nIf this is a **bug** and you can still reproduce this error on the latest <code>3.x-stable</code> or <code>master</code> branch, please reply with all of the information you have about it in order to keep the issue open.\n\nIf this is a **feature request**, please consider building it first as a plugin. Jekyll 3 introduced [hooks](http://jekyllrb.com/docs/plugins/#hooks) which provide convenient access points throughout the Jekyll build pipeline whereby most needs can be fulfilled. If this is something that cannot be built as a plugin, then please provide more information about why in order to keep this issue open.\n\nThis issue will automatically be closed in two months if no further activity occurs. Thank you for all your contributions.\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM1", "speaker": "MichaelCurrin", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2020-05-09T21:18:21Z", "text": "This is already possible based on answers here.\r\n\r\nhttps://stackoverflow.com/questions/14119772/how-to-change-extension-of-files-generated-by-jekyll\r\n\r\nAn arbitrary extension or no-extension file will be parsed with liquid if it has frontmatter and then jekyll outputs as .html\r\nAnd if you set the permalink in the file you can force the extension to be .json, .php , etc.\r\nMaybe set the permalink pattern globally in the config as a collection. You can set permalink for post but the response there was that it doesn't work in this case I think", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM2", "speaker": "NebelNidas", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2020-05-11T09:08:19Z", "text": "Yeah, that's the problem: I don't want to hardcode the path with permalinks, I just want to be able to adjust the file extension...", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM3", "speaker": "NebelNidas", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2020-05-11T09:09:50Z", "text": "Also, @DirtyF: It would be nice to at least give an explanation before just closing an issue, this way nothing will get resolved,", "meta": {"posReactions": "0", "negReactions": "0"}}
