{"id": "ROOT", "speaker": "archenemies", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2018-05-16T20:21:33Z", "text": "fix or document proper configuration for specifying default output order I have an HP Photosmart Plus B210a which prints pages face up. I am trying to figure out how to configure Cups to print documents so that I don't have to reverse them by hand when they come out of the printer.\r \r I found [a discussion on linuxquestions.org](https://www.linuxquestions.org/questions/ubuntu-63/can-i-set-the-cups-output-order-to-always-print-in-reverse-order-746843/) which summarizes a recommended fix:\r \r      Add the line\r      *DefaultOutputOrder: \"reverse\"\r      to the file\r      /etc/cups/ppd/PrinterName.ppd\r \r I have tried this with varying results. I printed twelve two-page documents to try to investigate what is happening. I tried printing via the `lp` command, via Evince and via Okular. I tried using a ppd file with and without the `DefaultOutputOrder` line, and I also tried specifying a default output order with `lpoptions` of \"reverse\" or \"normal\":\r \r     lpoptions -dHP_Photosmart_Plus_B210a -o outputorder=reverse\r     ...\r     lpoptions -dHP_Photosmart_Plus_B210a -o outputorder=normal\r \r The results:\r \r * `lp`: Ignores ppd line, honors lpoptions setting\r * Evince: Ignores lpoptions setting, honors ppd\r * Okular: Ignores both lpoptions and ppd\r \r As with the reporter of #1679, I would have expected the PPD which is downloaded by default for my printer to give the \"correct\" behavior by default, which is to say, not requiring me to manually reverse long documents when they come out of the printer.\r \r I also tried the solution of #1679, using\r \r     lpadmin -p printer -o outputorder-default=reverse\r     lpadmin -p printer -o outputorder-default=normal\r \r This setting was honored by Evince but not by `lp` or Okular.\r \r Okular's print dialog allows the user to change the ouput ordering, but Evince's print dialog, which appears more \"standard\" to me, says \"Page Ordering: Not available\".\r \r There was some mention of all documents going through `pstops` as a final filter. If this is true then it should be possible for Cups to give users a single point at which to configure output ordering, which works uniformly across all applications which might submit print jobs to Cups. In either case it should be documented what is the preferred way to deal with face-up printers.\r \r I humbly offer my suggestion that for \"outputorder=reverse\" to work intuitively as a per-job option, then it should interact with the per-printer option as a parity bit, e.g. reverse+reverse=normal, rather than as an \"override\" (reverse+reverse=reverse). In my experimentation it seems to be the latter, and I think this should be documented because it is somewhat different from the way that other options like \"page-ranges\" work. If I write a script to print the odd pages in order and then the even pages in reverse, I feel I should be able to get the same result (manual duplex) regardless of the printer model. In any case where the `lp` man page says:\r \r       -o outputorder=reverse\r           Prints pages in reverse order.\r \r I think it maybe should say something like:\r \r       -o outputorder=(reverse|normal)\r           Overrides printer output-order setting for this job. With\r           \"outputorder=reverse\", document will be reversed on\r           face-down printers, and correctly ordered on face-up\r           printers; and vice-versa for \"outputorder=normal\".\r \r Here is my PPD file in case it helps: [HP_Photosmart_Plus_B210a.ppd](https://github.com/apple/cups/files/2010726/HP_Photosmart_Plus_B210a.ppd.txt)\r ", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM0", "speaker": "michaelrsweet", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2018-05-17T15:41:29Z", "text": "OK, so I'm assuming from the list of applications you are using that you are using a Linux distribution of some sort. The PPD comes from the HPLIP project.\r\n\r\nUnfortunately, this isn't something we can help you with - either the cups-filters raster filter is not honoring the DefaultOutputOrder value in the PPD or the HPLIP driver isn't doing something right. Either way you need to start with your Linux distribution's bug reporter and go from there...\r\n\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM1", "speaker": "archenemies", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2018-05-17T17:55:26Z", "text": "Michael, I can submit the bug elsewhere but do you really mean to suggest that I need to know about HPLIP and cups-filters to understand why three different tools process the options I've set (using your software) in three different ways? What about the other questions I asked? You don't think any of your documentation needs to be fixed? Can you point me to the place in the documentation where you say which of lpadmin/lpoptions/PPD solutions is expected to make the printer work correctly with all CUPS clients? Who takes responsibility when other projects don't know how to interface correctly with your software?\r\n\r\nCan you give the HP people a hint on how the HP filter would need to be modified so that it respects the `lpadmin` setting not just with Evince print jobs but also with jobs submitted by Okular and `lp`? Or how can Okular be modified so that it prints correctly on inkjets?\r\n\r\nIs there another brand of inkjet printers, which works correctly with CUPS?\r\n\r\nWhat about cups-pdf, I've noticed that when printing to the virtual PDF printer then `lp` doesn't respect the lpadmin setting, Evince doesn't respect the lpoptions setting, and Okular doesn't respect either. Is that still an HP problem? Are you ever grateful to receive bug reports about your project?\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM2", "speaker": "michaelrsweet", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2018-05-17T18:01:15Z", "text": "@archenemies The non-CUPS software is not following the standard interfaces that CUPS provides. IOW, this is either a bug in HPLIP or cups-filters. If they follow the standard interfaces you won't have to do a damned thing to have things Just Work™. We can't fix software that isn't ours...\r\n\r\nAs for pstops, no not all jobs get routed through there. Maybe 18 years ago that was the case, but not today.\r\n\r\nAs for the documentation, it is correct if the underlying driver or filters follow the standard interfaces.\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM3", "speaker": "archenemies", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2018-05-18T01:58:12Z", "text": "So cups-pdf is HP's problem too? Is there any Linux software you can name that interfaces with CUPS correctly?\r\n\r\nIt would help to have an answer to this question, relating to the configuration of face-up printers:\r\n\r\n\"Can you point me to the place in the documentation where you say which of lpadmin/lpoptions/PPD solutions is expected to make the printer work correctly with all CUPS clients?\"\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM4", "speaker": "michaelrsweet", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2018-05-18T14:38:09Z", "text": "cups-pdf is from another developer. Both depend on cups-filters on Linux, which probably means that the problem lies with cups-filters.\r\n\r\nWe do not document printing solutions for Linux, working or otherwise. We don't write or support the software, and we don't make the distributions.", "meta": {"posReactions": "0", "negReactions": "0"}}
