{"id": "ROOT", "speaker": "bwateratmsft", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-02-13T16:51:08Z", "text": "Show a warning with Learn More link if SSH is in use without a working ssh-agent Resolves #1458 with @zifik's suggestion. Because an ssh-agent is required by the `ssh2` Node package (used by Dockerode) when using an SSH connection to a remote Docker daemon, we will show a warning with a Learn More link if SSH is in use without a working ssh-agent.\r \r The check is done by looking at the value for `SSH_AUTH_SOCK` (which on Windows can be defaulted to `\\\\.\\pipe\\openssh-ssh-agent`), and then trying to connect to that pipe to ensure it is actually working.\r \r The warning:\r ![image](https://user-images.githubusercontent.com/36966225/74459811-eccaf000-4e59-11ea-9867-4c4a08b6198c.png)\r \r The link: https://aka.ms/AA7assy", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM0", "speaker": "bwateratmsft", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-02-18T17:02:02Z", "text": "@karolz-ms, could you look at adjusting the docs per @diablodale's feedback?\r\n\r\nWe also currently have the ability to automagically work with WSL2 when using Docker Desktop's [WSL2 backend feature](https://docs.docker.com/docker-for-windows/wsl-tech-preview/). The extension uses the `docker context` command to detect whichever context is active when the extension activates.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM1", "speaker": "karolz-ms", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2020-02-18T17:23:46Z", "text": "@diablodale what would you like https://code.visualstudio.com/docs/containers/ssh documentation topic to say about WSL?\r\n\r\nThe whole topic is about \"connecting to remote Docker daemon\". With WSL there is no \"remote Docker daemon\" in the picture, so it should be pretty clear it does not apply to WSL. And with regards to WSL specifically we have this: https://code.visualstudio.com/docs/containers/choosing-dev-environment#_windows-subsystem-for-linux", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM2", "speaker": "karolz-ms", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2020-02-18T19:36:33Z", "text": "@diablodale thanks. We can certainly clarify in the doc which parts do not apply to WSL (or WSL 2). \r\n\r\nFull disclosure: I haven't tried the steps listed under https://code.visualstudio.com/docs/containers/ssh#_directly-via-ssh  with WSL, but I would expect them to work, so I would like to understand why you are saying they are not supported. Are you aware of any known issues with this setup and WSL? Or maybe you tried and found the steps not working/sufficient? Thanks in advance for clarification!", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM3", "speaker": "bwateratmsft", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2020-02-18T19:39:56Z", "text": "@karolz-ms You can use [Remote - WSL](https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-wsl) to attach VSCode to WSL (also, install the Docker extension within WSL; by default it runs as a UI extension). No configuration of the \"host\" (i.e. the Windows machine) is needed in that case. `bash` is automatically used as the terminal, and `dockerode` and `docker *` commands happen in the same context, so the setting `docker.host` (or env var `DOCKER_HOST`) will work for `ssh://...` values (as long as `SSH_AUTH_SOCK` is also set in WSL).\r\n\r\nWhen I tried with the Ubuntu distro, I had to call `eval $(ssh-agent -s)` and `ssh-add keyfile` from within `.bashrc` so that when the VSCode server-side process ran in WSL it would have the needed `SSH_AUTH_SOCK` environment variable, along with a running `ssh-agent` process, but I'm sure there are better ways to accomplish that. Once I did that everything worked as expected.\r\n\r\nIf you want to _not_ attach with Remote - WSL, then it is necessary to do the `ssh-agent` configuration in both Windows and WSL, because `dockerode` and `docker *` commands are not in the same context.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM4", "speaker": "karolz-ms", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2020-02-18T19:52:38Z", "text": "@bwateratmsft thank you, that is exactly what I would expect. Based on that I would consider WSL supported.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM5", "speaker": "karolz-ms", "conversation_id": "ROOT", "reply_to": "COM4", "timestamp": "2020-02-18T21:07:20Z", "text": "@diablodale thanks for clarification. I think I understand where you are coming from. The difference is in the mental model of what WSL really is. Is it *a shell*? This is how it was originally advertised (\"bash on Windows\"), but it evolved into something that nowadays most people here at Microsoft would describe it as *virtual environment for running Linux programs*. That has been made very prominent with WSL 2 and its native Linux kernel. And with this the expected, default level of integration between Win32 and WSL environment (as well as between different WSL instances) is really none. They are completely isolated.\r\n\r\nArguably complete isolation is not always the most practical choice, so WSL (and tools that leverage it) have multiple integration points with Win32 (file system mounts, socket mounts, the new Docker implementation for WSL2, VS Code Remote-WSL extension are good examples). The fundamental principle remains though that WSL environments and Win32 are isolated by default.\r\n\r\nI can see your point that for SSH connectivity (and probably other things) there is not enough integration and I agree. It is a pain to manage all the SSH identities separately for Win32 vs WSL. But this is largely an issue outside of the VS Code Docker extension control. @bwateratmsft  confirmed that  the setup described in the doc you referenced IS working with WSL, with the design of WSL as it is today. If anybody reports that it is not working, we will investigate. Hence it is supported.\r\n\r\nThank you for taking time to share your thoughts!", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM6", "speaker": "karolz-ms", "conversation_id": "ROOT", "reply_to": "COM5", "timestamp": "2020-02-18T23:30:19Z", "text": "Understood that we are not talking about method 1\r\n\r\nWSL is supported via Remote-WSL extension. When that extension is used, a headless instance of VS Code is installed into WSL environment. Then one can use that VS Code instance to install headless instance of Docker extension into WSL environment. That headless extension instance will see WSL environment configuration, including SSH/Docker configuration, and will drive the Docker extension UI running on Win32 side. All the data comes from the WSL environment and all the Docker commands are executed in that environment. The only caveat that Brandon describes is that ssh-agent configuration does not survive WSL environment restart, so it needs to be re-created via `.bashrc` file. This probably needs to be added to the doc. Everything else in https://code.visualstudio.com/docs/containers/ssh#_directly-via-ssh doc applies to WSL via Remote-WSL unchanged. \r\n\r\nWhat is not supported is running VS Code and Docker extension entirely on Win32 side, without Remote-WSL extension. At least not without extra manual work of keeping Win32 and WSL configuration in sync. This goes back to the point they are isolated environments.\r\n\r\nHope this clarifies things but please let me know if I missed something. ", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM7", "speaker": "bwateratmsft", "conversation_id": "ROOT", "reply_to": "COM6", "timestamp": "2020-02-19T17:57:08Z", "text": "I agree that those are gaps in the documentation, but I'm not convinced that we _should_ document them. There's probably an infinite number of ways and combinations of ways to make remote connectivity work, but I think that our docs should stick to the beaten path(s), so to speak:\r\n\r\nA - Want to talk to remote Docker via HTTP? Use the appropriate `DOCKER_*` env vars or `docker.*` settings.\r\n\r\nB - Want to talk to remote Docker via SSH? Use Remote - SSH with Docker extension installed inside (preferred), or use the SSH features the Docker extension has (`DOCKER_HOST` / `docker.host` and `SSH_AUTH_SOCK`).\r\n\r\nC - Want to talk to remote Docker in WSL? Use Remote - WSL with Docker extension installed inside (preferred), or stand up SSH within WSL and use the SSH features the Docker extension has.\r\n\r\nD - Want to talk to remote Docker in WSL2? Use Remote - WSL with Docker extension installed inside (preferred), or the Docker WSL2 backend feature (preferred, but somewhat less so) (no extension config needed), or stand up SSH within WSL2 and use the SSH features the Docker extension has.\r\n\r\nMethod 3 (Remote - WSL + SSH) is a combination of options C and B, IMO better solved with just option B alone, so I'd prefer to not document it. The variant of method 2 (WSL as shell + SSH) is essentially option B but since it uses WSL as a shell, requires additional config work due to the disparate environments.\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
