{"id": "ROOT", "speaker": "feross", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2019-08-19T23:02:47Z", "text": "npm install funding # The experiment is over – read the [recap](https://feross.org/funding-experiment-recap/) here!\r \r Hey folks! 👋\r \r I've already spoken to a few of you about this idea, but I'd like to share it with the broader community now that `standard` 14 has shipped.\r \r **Background:** I think that the current model of sustaining open source is not working and we need more experimentation. This is one such experiment.\r \r **What's the experiment?** Whenever `standard` 14 is installed, we'll display a message from a company that supports open source. The sponsorship pays directly for maintainer time. That is, writing new features, fixing bugs, answering user questions, and improving documentation.\r \r **What's the goal?** My goal with this experiment is to make `standard` healthier. If we learn that the experiment works, perhaps we can help make all open source healthier, too. For complex reasons, companies are generally hesitant or unwilling to fund OSS directly. When it does happen, it's never enough and it never reaches packages which are transitive dependencies (i.e. packages that no one installs explicitly and therefore no one knows exists). Essentially, we have a public good which is consumed by huge numbers of users, but which almost no one pays for. Fortunately, there exists a funding model that usually works for public goods like this – ads. The goal of this experiment is to answer the question: Can we use ethical ads – ads that don't track users or collect data – to fund open source software?\r \r **What does the code do?** The code for this experiment is available here: [`feross/funding`](https://github.com/feross/funding). Essentially, it calls `console.log()` on some text. There is no tracking, data collecting, or unexpected behavior. You can look at the code to verify – indeed, this is the beauty of open source!\r \r **What will the funds be used for?** The funds raised so far ($2,000) have paid for Feross's time to [release Standard 14](https://standardjs.com/changelog.html#1400---2019-08-19) which has taken around five days. If we are able to raise additional funds, the next thing I'd like to focus on is out-of-the-box TypeScript support in StandardJS (one of the most common feature requests!) and modernizing the various text editor plugins (many of which are currently unmaintained). If others in the community are interested in taking the lead on any of these issues, I'd like to direct some funds to you.\r \r Feedback welcome!\r \r ---\r \r ## EDIT: This thread is now locked :lock:\r \r For why + next steps, [scroll to the end >>](https://github.com/standard/standard/issues/1381#issuecomment-524589455)\r \r ## EDIT: The experiment is over – Feross posted [a recap](https://feross.org/funding-experiment-recap/) on his blog", "meta": {"posReactions": "47", "negReactions": "704"}}
{"id": "COM0", "speaker": "billiegoose", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2019-08-20T15:09:29Z", "text": "> Feedback welcome!\r\n\r\nI noticed the (fairly large bright bold) banner. It reminds me of the OpenCollective-style banners used by webpack / corejs.\r\n\r\n![image](https://user-images.githubusercontent.com/587740/63358843-b47aa700-c339-11e9-991a-0c9f78f51373.png)\r\n\r\nI think it's OK... I do worry that `npm install` will just become a long trail of banner ads though eventually and it won't scale. Because if _every_ npm package adds ads, the noticeability of each ad will diminish. (Interestingly, the most valuable \"realestate\" will be packages whose banner is displayed _last_, so if it becomes a literal \"race-to-the-bottom\" people might add `sleep` statements to their post-install scripts so they are displayed nearest the bottom. What a dystopian installation experience!)\r\n\r\nFun fact: `yarn` does not display the output of post-install scripts. One might say yarn has built-in ad-blocking.", "meta": {"posReactions": "232", "negReactions": "4"}}
{"id": "COM1", "speaker": "evantahler", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2019-08-20T19:36:57Z", "text": "While I'm totally OK with this on development machines, I think this is strange behavior for staging/production/etc.  Perhaps https://github.com/feross/funding/blob/master/index.js should have a NODE_ENV check?\r\n\r\nThen again, I don't imagine `standard` is going to be installed outside of NODE_ENV={test, development} anyway... so it's probably OK!", "meta": {"posReactions": "1", "negReactions": "62"}}
{"id": "COM2", "speaker": "mixmix", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2019-08-21T23:17:55Z", "text": "I am whole-heartedly behind this experiment.\r\nIt's not the perfect end solution, but that's not the point - it's about moving the conversation about how to build healthy relationships between our commons and companies forward.\r\n\r\nThanks for taking leadership on this @feross . ", "meta": {"posReactions": "9", "negReactions": "126"}}
{"id": "COM3", "speaker": "zoeyTM", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2019-08-21T23:31:27Z", "text": "Admittedly, I haven't contributed an immense amount to open source code, so I realize I don't have the same perspective on this issue. That being said, I sincerely hope that this solution does not become standard. \r\n\r\nI agree wholeheartedly that this is a problem that needs a solution, and I am glad that the conversation is being pushed forward by this experiment. Advertisements in my terminal is not the solution.\r\n\r\nFor me, `yarn` or `\"standard\": \"^13.0.0\"` is going to have to be my \"standard\" until this is removed.\r\n\r\n[Fifteen Million Installs](https://en.wikipedia.org/wiki/Fifteen_Million_Merits)", "meta": {"posReactions": "161", "negReactions": "3"}}
{"id": "COM4", "speaker": "mhogerheijde", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2019-08-22T14:51:51Z", "text": "I'm with @morgansliman, of any place I don't want to see ads, my terminal is on the top of that list.\r\n\r\nI would a low a \"buy me a coffee\"-link, but that's about it.\r\n\r\nOn another note: For me, it was totally not clear that this ad was for a company that donates to `standard`. So it took me a while to figure out where this ad came from. So I'm not sure what the ad should convey, but I don't think it is the feeling \"what is this and how do I get rid of it?\".", "meta": {"posReactions": "89", "negReactions": "0"}}
{"id": "COM5", "speaker": "ckipp01", "conversation_id": "ROOT", "reply_to": "COM4", "timestamp": "2019-08-22T16:02:01Z", "text": "First off, I love standard and use it in all my JS projects. Thank you so much for your hard work in making a fantastic, easy-to-use, and solid linter.\r\n\r\nI was really taken off guard seeing this in my terminal today. It's the last place I expect to see an ad, and really the last place I want to. While I get the idea behind it, and I agree that we must think of innovative ways to support open-source, relying on displaying an ad in a place that typically doesn't have them opens up the doors to new behavior of ad spamming when I simply want to install a dependency.\r\n\r\nI'm not saying this is the case here, but let's say that this really frustrates a percentage of developers and they decide to no longer use the project/tool/library, but the project does see an uptick in sponsorship. More than likely they'd see that as a win, and this could slowly shift the focus from a community-driven project to a sponsorship-driven project (and not as in individual sponsors, but company sponsorship). Again, I'm not saying this is the case here, but you can sort of see how that could happen if this becomes a normal practice in how we try to support open-source projects.\r\n\r\nI'd much rather see an innovative solution that tries to encourage individual community members to give more to projects they want to support rather than relying on sponsorship ads.\r\n\r\nFinally, I also agree with @mhogerheijde, when I first saw this I was confused, and my initial thought was to immediately find the package and to remove it since it wasn't clear at all where this was coming from or why an ad was in my terminal.\r\n\r\nEDIT: spelling\r\n\r\n", "meta": {"posReactions": "29", "negReactions": "0"}}
{"id": "COM6", "speaker": "mixmix", "conversation_id": "ROOT", "reply_to": "COM5", "timestamp": "2019-08-22T20:00:33Z", "text": "Great point that it could be more clear why the ads there, and specifically\nthat it's making the tools you love maintainable.\n\nI think if you're not into it, then the obligation is in you to put some\nwork in to come up with more aligned solutions.\n\nEnthusiastic verbal support does not help maintainers thrive.\n\nAt the moment many of them are generously giving and experience a few\nbreadcrumbs of thanks in return.\n\nI want to live in a world where maintainers have enough to pay rent, eat\nfood, have health care, save money, dream about big future projects.\n\n\n\nOn Fri, 23 Aug 2019, 04:02 Chris, <notifications@github.com> wrote:\n\n> First off, I love standard and use it in all my JS projects. Thank you so\n> much for your hard work in making a fantastic, easy-to-use, and solid\n> linter.\n>\n> I was really taken off guard seeing this in my terminal today. It's the\n> last place I expect to see an add, and really the last place I want to.\n> While I get the idea behind it, and I agree that we must think of\n> innovative ways to support open-source, relying on displaying an add in a\n> place that typically doesn't have them opens up the doors to new behavior\n> of add spamming when I simply want to install a dependency.\n>\n> I'm not saying this is the case here, but let's say that this really\n> frustrates a percentage of developers and they decide to no longer use the\n> project/tool/library, but the project does see an uptick in sponsorship.\n> More than likely they'd see that as a win, and this could slowly shift the\n> focus from a community-driven project to a sponsor-driven project. Again,\n> I'm not saying this is the case here, but you can sort of see how that\n> could happen if this becomes a normal practice in how we try to support\n> open-source projects.\n>\n> I'd much rather see an innovative solution that tries to encourage\n> individual community members to give more to projects they want to support\n> rather than relying on sponsorship adds.\n>\n> Finally, I also agree with @mhogerheijde <https://github.com/mhogerheijde>,\n> when I first saw this I was confused, and my initial thought was to\n> immediately find the package and to remove it since it wasn't clear at all\n> where this was coming from or why an add was in my terminal.\n>\n> —\n> You are receiving this because you commented.\n> Reply to this email directly, view it on GitHub\n> <https://github.com/standard/standard/issues/1381?email_source=notifications&email_token=AAUK3HVSVRIKOQRBTT2VO2TQF22BFA5CNFSM4INH7WL2YY3PNVWWK3TUL52HS4DFVREXG43VMVBW63LNMVXHJKTDN5WW2ZLOORPWSZGOD45SDTI#issuecomment-523968973>,\n> or mute the thread\n> <https://github.com/notifications/unsubscribe-auth/AAUK3HTGZ2JHVTQG6C4XLADQF22BFANCNFSM4INH7WLQ>\n> .\n>\n", "meta": {"posReactions": "6", "negReactions": "65"}}
{"id": "COM7", "speaker": "mhogerheijde", "conversation_id": "ROOT", "reply_to": "COM6", "timestamp": "2019-08-23T07:20:08Z", "text": "This isn't about having our cake and eating it too. Selling ad-space is not innovative. And it's particularly unhelpful in my logs.\r\n\r\nI don't fully agree with @ckipp01 on the sponsorship driven OSS. It is a risk, but it already exists outside of selling ad-space in logs.\r\n\r\nFor me, the issue is more that I don't want stuff that doesn't help me in my logs. I wholeheartedly agree with putting your \"supported by company X\" in the readme. That helps me understand, it does resonate with me when I see certain companies donating money to OSS.\r\n\r\nBy the way, just stating that \"if you don't like it, come up with a better solution\" is a cop-out. There _is_ value in feedback, _especially_ when you don't agree.\r\n\r\nEDIT: PS: I too want to live in a perfect world where every developer can live, pay rent and only work on projects they like. That perfect world for me does not include ads in my terminal.\r\n\r\nEDIT2: PPS: Support of my peers for me is a _big_ reason to work on stuff. I know others that earn enough in their day-job that they enthusiastically spend time on OSS in their free time as a hobby and get value out of verbal support from their peers. That support is more often than not shown in a verbal/written way.", "meta": {"posReactions": "80", "negReactions": "0"}}
{"id": "COM8", "speaker": "vweevers", "conversation_id": "ROOT", "reply_to": "COM7", "timestamp": "2019-08-23T08:21:40Z", "text": "> By the way, just stating that \"if you don't like it, come up with a better solution\" is a cop-out.\r\n\r\nFact of the matter is, OSS maintainers need money _today_. Better solutions may come along; putting up with ads in the mean time is a small price to pay. While I don't particularly like seeing ads in this space, I understand its necessity and fully support it.\r\n\r\nI do agree that:\r\n\r\n> it could be more clear why the ads there, and specifically that it's making the tools you love maintainable.", "meta": {"posReactions": "12", "negReactions": "66"}}
{"id": "COM9", "speaker": "ArcanisCz", "conversation_id": "ROOT", "reply_to": "COM8", "timestamp": "2019-08-23T09:12:25Z", "text": "That reminds me of the article https://www.theatlantic.com/technology/archive/2014/08/advertising-is-the-internets-original-sin/376041/ . Basically, our hated ads-driven business model of internet (google, facebook, ...) was forced to original publishers by people.... (posting it as a slight OT because when people dont know history, they tend to make same mistakes and desicisons)", "meta": {"posReactions": "7", "negReactions": "0"}}
{"id": "COM10", "speaker": "brodybits", "conversation_id": "ROOT", "reply_to": "COM9", "timestamp": "2019-08-23T09:32:02Z", "text": "Hi @feross, I would favor advertisements for services that you would be willing to offer, either personally or from a company that you own and run.", "meta": {"posReactions": "3", "negReactions": "11"}}
{"id": "COM11", "speaker": "mhogerheijde", "conversation_id": "ROOT", "reply_to": "COM10", "timestamp": "2019-08-23T09:37:30Z", "text": "@vweevers Nobody is denying that money needs to flow to OSS maintainers. I don't mind putting up with ads _anywhere else_ than in the logs of my build. There is plenty of space in things like README's and landing pages for links to sponsors and patreon(-like) solutions. Logs for me are a way of doing my job. I will (try to) weed out anything that negatively impacts my ability to do work.\r\n\r\nAlso, consider the effect that letting people know that you've got sponsoring can diminish the amount of support you get from your peers, as Matthias Wandel points out in one of his videos: https://www.youtube.com/watch?v=SToyIb9tNiY\r\n\r\n@ArcanisCz interesting read!\r\n\r\n@brodybits you mean you prefer ads for services from @feross over 3rd party ads? I agree, I probably wouldn't make this much a fuss if the advertisement was a single line with a link to buy them a cup of coffee or a side-project.", "meta": {"posReactions": "38", "negReactions": "0"}}
{"id": "COM12", "speaker": "brodybits", "conversation_id": "ROOT", "reply_to": "COM11", "timestamp": "2019-08-23T10:03:29Z", "text": "> @brodybits you mean you prefer ads for services from @feross over 3rd party ads?\r\n\r\nYes.", "meta": {"posReactions": "0", "negReactions": "3"}}
{"id": "COM13", "speaker": "arcanis", "conversation_id": "ROOT", "reply_to": "COM12", "timestamp": "2019-08-23T11:14:28Z", "text": "As maintainer of Yarn I'm strongly against this pattern, although not for the reasons you might think. **Post-install scripts deoptimize packages and break workflows.**\r\n\r\nWhen a package has postinstall scripts, we (package managers) cannot assume anymore that it's safe to share its directory between projects. Even worse, we must extract it on the disk (in case there's a build step) even if it's actually completely unnecessary (because you only print things). We've been exploring a lot of optimisations in this space lately (Yarn 2 will keep your packages within their archives by default), and this kind of pattern will prevent your users from exploiting them to full benefits.\r\n\r\n*(Note that I'm not saying the postinstall scripts are deprecated - just that they should be reserved to the use case they were designed for, which is building a package against a local environment)*\r\n\r\nFwiw, as is mentioned somewhere in this thread, Yarn already doesn't print the build logs unless they make the installs crash, so this post-install script wouldn't have any visible effect for our users. Still, I value the health of the ecosystem a lot, both from the point of view of maintainers and users, and I would be happy to discuss how we could satisfy this use case in a more integrated and less intrusive way (for example by adding a specific field to the `package.json`). I've actually opened [an issue](https://github.com/opencollective/opencollective/issues/1625) against the OpenCollective repo to discuss that, but it got no traction until now.", "meta": {"posReactions": "110", "negReactions": "0"}}
{"id": "COM14", "speaker": "tommck", "conversation_id": "ROOT", "reply_to": "COM13", "timestamp": "2019-08-23T12:07:57Z", "text": "I agree with a bunch of folks here that the goal here is great, but I already have enough trouble getting devs to pay attention to warnings like \"unmet peer dependencies\" when an npm install is finished. Having screens of ads go by makes it impossible to see them.\r\n('core-js' comes to mind begging for money AND a job for the lead dev)\r\n\r\n[Update: spelling]", "meta": {"posReactions": "38", "negReactions": "0"}}
{"id": "COM15", "speaker": "CalinLeafshade", "conversation_id": "ROOT", "reply_to": "COM14", "timestamp": "2019-08-23T12:21:15Z", "text": "Companies should sponsor OSS projects because they use them. Not to get ads in front of the project's users.\r\n\r\nAlso, this kind of thing is easily blocked so it's unlikely to be a good revenue stream anyway.", "meta": {"posReactions": "56", "negReactions": "0"}}
{"id": "COM16", "speaker": "ljosberinn", "conversation_id": "ROOT", "reply_to": "COM15", "timestamp": "2019-08-23T14:13:21Z", "text": "I'm all for (better) compensation of OSS developers but I will go lengths to avoid ads, just any ads in general. Ads are a toxic pest in modern days, wherever you go you're slammed with them. The console is not intended for this either.\n\nIf this means I have to change a dependency or library to not have ads, I will do it, not because you don't deserve money, but because you're intruding an area you're not supposed to intrude by design. \n\n_Edited a word. _ ", "meta": {"posReactions": "40", "negReactions": "0"}}
{"id": "COM17", "speaker": "bunchopunch", "conversation_id": "ROOT", "reply_to": "COM16", "timestamp": "2019-08-23T14:13:56Z", "text": "If a company is advertising in my terminal, even if they're technically sponsoring a project as means to do so, I will do everything I can to avoid that company. Whether or not they know it, I'm pretty sure this is the exact opposite of the sort of publicity these sponsors would want among developers.", "meta": {"posReactions": "103", "negReactions": "1"}}
{"id": "COM18", "speaker": "Vpet95", "conversation_id": "ROOT", "reply_to": "COM17", "timestamp": "2019-08-23T14:24:11Z", "text": "My terminal is the one last stronghold, the one last haven of peace that doesn't endlessly serve me ads from corporate overlords all day long. I vehemently oppose this idea as I believe it is fundamentally opposed to the open source ethos we've built up over decades. \r\n\r\nYes, it's important to help out open source contributors and project owners - but ads are not the solution. ", "meta": {"posReactions": "73", "negReactions": "0"}}
{"id": "COM19", "speaker": "brodybits", "conversation_id": "ROOT", "reply_to": "COM18", "timestamp": "2019-08-23T16:19:15Z", "text": "-1 for that kind of non-permissive licensing, it does not even seem to fit the definition of \"open source\" ref:\r\n* https://opensource.org/osd#persons-or-groups\r\n* https://opensource.org/osd#fields-of-endeavor\r\n\r\n+1 for offer of services from the primary author, which is sometimes needed to help with open-source sustainability\r\n\r\n-1 for promotion of third-party products or services (noisy, distracting, etc.)", "meta": {"posReactions": "7", "negReactions": "0"}}
{"id": "COM20", "speaker": "lightswitch05", "conversation_id": "ROOT", "reply_to": "COM19", "timestamp": "2019-08-23T18:44:26Z", "text": "The package maintainers are welcome to do as they see fit. However, I would like a way to opt-out entirely from this package ever being install into my system. As far as I can tell, that is not possible with NPM.\r\n\r\nhttps://npm.community/t/blacklist-entire-packages/9659", "meta": {"posReactions": "29", "negReactions": "0"}}
{"id": "COM21", "speaker": "FirstWhack", "conversation_id": "ROOT", "reply_to": "COM20", "timestamp": "2019-08-23T18:59:55Z", "text": "This does 2 things, 1 is objectively bad and one is subjective.\r\n\r\n1. Encourages users to run with `--silent` as an adblocker \r\n    - Bad because it means users won't see critical errors, security warnings etc\r\n    - If we can agree it's bad to encourage users to ignore key warnings, we inherently agree that polluting the output of `install` is bad _for the exact same reason_.\r\n2. It's the most annoying thing you could possibly do as a package maintainer other than remove your package.\r\n\r\nRegardless, NPM will undoubtedly decide to block any method of serving advertisements through the terminal. It doesn't matter what Standard chooses to do.", "meta": {"posReactions": "32", "negReactions": "0"}}
{"id": "COM22", "speaker": "mzzfederico", "conversation_id": "ROOT", "reply_to": "COM21", "timestamp": "2019-08-23T19:40:55Z", "text": "If it will change the name of this project to something sensible, I will greet them with open arms ", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM23", "speaker": "kinow", "conversation_id": "ROOT", "reply_to": "COM22", "timestamp": "2019-08-24T12:28:15Z", "text": "Dang it. Just enabled it the other week, already going to have to raise another PR to remove from the project now :disappointed: ", "meta": {"posReactions": "15", "negReactions": "0"}}
{"id": "COM24", "speaker": "steve-perkins", "conversation_id": "ROOT", "reply_to": "COM23", "timestamp": "2019-08-24T12:37:33Z", "text": "Given that this package is essentially a config file and thin wrapper script for ESLint, I am curious how much of this revenue will be shared with the upstream ESLint developers.", "meta": {"posReactions": "135", "negReactions": "0"}}
{"id": "COM25", "speaker": "osmarks", "conversation_id": "ROOT", "reply_to": "COM24", "timestamp": "2019-08-24T13:08:04Z", "text": "We are going to need adblockers for `npm install` output now...\r\n\r\nNow I'm actually wondering how that might work... maybe just blocking specific packages' postinstall scripts would do it. For now. It's not like there's some easy way to detect sponsored messages.", "meta": {"posReactions": "12", "negReactions": "0"}}
{"id": "COM26", "speaker": "rubyFeedback", "conversation_id": "ROOT", "reply_to": "COM25", "timestamp": "2019-08-24T13:17:58Z", "text": "This is a very bad idea. It violates the user's right to privacy and choice.\r\n\r\nI even go farther and say that it is abuse by upstream developers (does not matter WHO these developers are; feross could be replaced by any other developer who wants to abuse users).\r\n\r\nIf the goal is to seek financing, it would be better to request donations etc...\r\n\r\nNote that some users may be ok with ads, but it is NOT ok to NOT ask users whether they are fine with that. Because many are NOT fine with targeted ads.", "meta": {"posReactions": "9", "negReactions": "0"}}
{"id": "COM27", "speaker": "chriscarver", "conversation_id": "ROOT", "reply_to": "COM26", "timestamp": "2019-08-24T13:18:58Z", "text": "How can you be so smart and stupid at the same time. This idea is horrible.", "meta": {"posReactions": "21", "negReactions": "8"}}
{"id": "COM28", "speaker": "osmarks", "conversation_id": "ROOT", "reply_to": "COM27", "timestamp": "2019-08-24T13:21:04Z", "text": "> Because many are NOT fine with targeted ads.\r\n\r\nIn fairness, this appears to not actually be very targeted - it's just a postinstall script in the `funding` package.\r\n\r\n", "meta": {"posReactions": "2", "negReactions": "0"}}
{"id": "COM29", "speaker": "NuroDev", "conversation_id": "ROOT", "reply_to": "COM28", "timestamp": "2019-08-24T13:49:49Z", "text": "I do love OSS and all the amazing open source projects available ❤️ and I do very much understand that funding is required now for many projects and services such as Open Collective and/or GitHub Sponsors either don't work for their needs or don't meet their funding needs.\r\nHowever, my fear is that this `experiment` will result in many more OSS projects picking it up and lead to a future where CI build logs are full of banner ads and then potentially lead to other worse advertising means.\r\nThe user `u/crabbytag` [put it best](https://www.reddit.com/r/programming/comments/cus0zu/a_3mil_downloads_per_month_javascript_library/exy73hc?utm_source=share&utm_medium=web2x) for me and my concerns for what this could start in the future.\r\n\r\n> This reminds me of the early years of the web when websites were looking for funding. At that time, adding a banner or two brought in revenue. People were clicking out of sheer novelty effect. But as it became more widespread, people started ignoring it. Then websites had to resort to more aggressive ads - animated banners, pop-ups, pop-unders. When those started getting blocked, they moved to advanced tracking.\r\nThe maintainer is getting $2000 for these banners because no one else is displaying ads there. Once other library authors notice this opportunity, they'll start adding ads too. Then the average payout comes down. But since we've already accepted ads here, some authors will include more annoying ads for slightly more money. For example, 2x the payout if the developer is required to take some action ('press enter to unpause the build) and 3x if the action is more annoying ('type out \"Linode rocks\" to unpause the build).\r\n\r\nThat's just me of course but I feel like this is not the correct direction to go towards in helping to fund open source projects and we need to continue looking for another alternative.", "meta": {"posReactions": "14", "negReactions": "0"}}
