{"id": "ROOT", "speaker": "matti", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-09-03T20:22:01Z", "text": "cnn.com time to interactive is 11s-22s screenshot from pagespeed, which says 11s, my own i9 macbook16 says 22s with lighthouse\r \r <img width=\"1354\" alt=\"image\" src=\"https://user-images.githubusercontent.com/3893/92163261-0bb3c280-ee3c-11ea-94e6-9318eccbf30e.png\">\r ", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM0", "speaker": "devtools-bot", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2020-09-03T20:27:13Z", "text": "Thanks! Appreciate you filing this bug. :clap:\n\nThis is a known issue, most well described in #10657. So, **we'll automatically close this as a duplicate**.\n\n:robot: Beep beep boop. ", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM1", "speaker": "matti", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2020-09-03T20:31:55Z", "text": "@patrickhulce how is a clearly wrong result due to variability? anyone can see that cnn time to interactive is not 11s-22s", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM2", "speaker": "patrickhulce", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2020-09-03T20:38:28Z", "text": "Ah, from your bug report it appeared as though you were asking why it's 11s in one environment and 22s in another, which is an extremely common question answered by the linked documentation :)\r\n\r\n> anyone can see that cnn time to interactive is not 11s-22s\r\n\r\nI think there's a misunderstanding with what the \"Time to Interactive\" metric measures then. Have you read through [the TTI docs](https://web.dev/tti/)? CNN definitely has a ton of main-thread work and is one of the canonical examples of a high TTI.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM3", "speaker": "matti", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2020-09-03T20:50:01Z", "text": "So the docs say:\r\n\r\n> Measuring TTI is important because some sites optimize content visibility at the expense of interactivity. This can create a frustrating user experience: the site appears to be ready, but when the user tries to interact with it, nothing happens.\r\n\r\nBut this is simply not true, it does not take 11s for CNN to be interactive.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM4", "speaker": "hooligani", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2020-09-03T20:51:22Z", "text": "from web.dev\r\n\r\n```\r\nTTI measures how long it takes a page to become fully interactive. A page is considered fully interactive when:\r\n\r\nThe page displays useful content, which is measured by the First Contentful Paint,\r\nEvent handlers are registered for most visible page elements, and\r\nThe page responds to user interactions within 50 milliseconds.\r\n```\r\n\r\nJust open a browser to cnn.com and you can start clicking interacting with it after 1 second latest. No frustration from the user.\r\n\r\nJust making the case if TTI or LCP even try to model the REAL user experience or have we given up on that already.\r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM5", "speaker": "patrickhulce", "conversation_id": "ROOT", "reply_to": "COM4", "timestamp": "2020-09-03T21:12:48Z", "text": "> The page responds to user interactions within 50 milliseconds.\r\n\r\nThat is the root factor at play here. Lighthouse computes this value faithfully in the case of CNN because holy crap look at that main-thread (16\" Macbook i9).\r\n\r\n![image](https://user-images.githubusercontent.com/2301202/92168554-4c8de600-ee00-11ea-8773-aaf1c4377046.png)\r\n\r\n\r\nIt sounds like you disagree that this 50ms task limit is a reasonable condition to have in an interactivity metric, but that's not really something that's up for debate. That's the metric definition after years of work by a Chrome team dedicated to metrics and dozens of evaluated alternatives you're free to read about if you wish. \r\n\r\nIf it helps, the weight of TTI in the overall score has been steadily declining over the past 2 years and is unlikely to increase in the near future. It does, however, capture an important moment when the page is actually done loading all of its stuff, and it won't be disappearing anytime soon.", "meta": {"posReactions": "0", "negReactions": "0"}}
