{"id": "ROOT", "speaker": "chinmaygarde", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2021-01-25T10:40:48Z", "text": "[Prototype] [Do NOT Merge] Binary Metal Archive Prototype for iOS/Mac. This patch wires up Metal Binary Archives for Mac and iOS. Metal Binary Archives\r are used to cache pipeline state objects generated at runtime on the device and\r serialize them to disk when rendering is paused. In this prototype, the binary\r archives are serialized to disk when the application moves into the background.\r On the next launch of the application, the serialized representation of the\r archives is used for the creation of new pipeline state objects.\r \r Per the [details in the linked issue][1], I do not recommend we land this patch.\r This PR is just meant to be a record of the prototyping work done to evaluate\r Metal Binary Archives for Flutter.\r \r [1]: https://github.com/flutter/flutter/issues/60267#issuecomment-762786388\r \r ## Observations\r \r Once patched in, the following observations can be made while running a Flutter application.\r \r * After first launch, the application caches directory should contain a `.metallib` file with the following format. `flutter_engine_<engine_version>_<skia_version>_<index>.metallib`. This was done so any changes to the Flutter engine or the Skia version would not run the risk of using invalid cached contents. The file ([example](https://github.com/flutter/engine/files/5865817/flutter_engine_08daa2c8962687253fbcbd812d08d70c34c86721_069e484cc3b9518f115312c065a6f9c843b0839a_0.metallib.zip)) seems to be a Mach-O binary. This is consistent with Apple's recommendation that the `lipo` tool be used to combine archives harvested from devices of different GPU families.\r * This file will get updated every time the application is backgrounded and will get reused when the application is launched.\r * To prevent any issues with threading (I could find no mention in the docs about the thread safety aspects of any of the APIs) only raster thread operations will using this archive.\r * One open question not answered in my linked comment was how much these archives would help for jank during subsequent application launches (as seeding the archive for first launch is a no-go). I tried to find determine this by making sure the cache was seeded and launching the application again. My hope was to see a reduction in the `GrMtlPipelineStateBuilder::finalize` trace in Observatory. This [did not materialize (trace is from a warmed up archive)](https://github.com/flutter/engine/files/5865862/warmed_cached_pipeline_state_extra_skia_traces.json.zip). This seems to be because the primary cause of jank in pipeline state setup is the construction of the Metal shader library (SKSL -> MSL -> MTLLibrary (AIR?)) and not the pipeline state object construction. An annotated version of one of the traces is as follows:\r ![Screen Shot 2021-01-25 at 2 24 51 AM](https://user-images.githubusercontent.com/44085/105694897-5058fc80-5eb6-11eb-8440-5b6f973abe0a.png)", "meta": {"posReactions": "2", "negReactions": "0"}}
{"id": "COM0", "speaker": "flutter-dashboard[bot]", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2021-01-25T10:40:51Z", "text": "It looks like this pull request may not have tests. Please make sure to add tests before merging. If you need an exemption to this rule, contact Hixie on the #hackers channel in [Chat](https://github.com/flutter/flutter/wiki/Chat).\n\n__Reviewers__: Read the [Tree Hygiene page](https://github.com/flutter/flutter/wiki/Tree-hygiene#how-to-review-code) and make sure this patch meets those guidelines before LGTMing.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM1", "speaker": "escamoteur", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2021-01-26T10:30:41Z", "text": "Just curious, why isn't it possible to cache or even distribute the MSL version of the shaders instead of doing the translation fom SKLS to Msl at runtime? Or even precompile Msl?\r\nDid you have a look how https://github.com/kakashidinho/metalangle solves this?", "meta": {"posReactions": "7", "negReactions": "0"}}
{"id": "COM2", "speaker": "huvi8161", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2021-01-28T15:29:01Z", "text": "One more question regarding your statement @chinmaygarde, \"This seems to be because the primary cause of jank in pipeline state setup is the construction of the Metal shader library (SKSL -> MSL -> MTLLibrary (AIR?)) and not the pipeline state object construction.\", could we do something to speed up creation of Metal shader library?", "meta": {"posReactions": "2", "negReactions": "0"}}
{"id": "COM3", "speaker": "dnfield", "conversation_id": "ROOT", "reply_to": "COM2", "timestamp": "2021-02-03T17:54:00Z", "text": "@chinmaygarde - what if we could get skia to use https://developer.apple.com/documentation/metal/mtldevice/1433391-newlibrarywithdata?language=occ instead? It seems like that should be faster...", "meta": {"posReactions": "3", "negReactions": "0"}}
{"id": "COM4", "speaker": "escamoteur", "conversation_id": "ROOT", "reply_to": "COM3", "timestamp": "2021-02-03T22:22:58Z", "text": "> @chinmaygarde - what if we could get skia to use https://developer.apple.com/documentation/metal/mtldevice/1433391-newlibrarywithdata?language=occ instead? It seems like that should be faster...\r\n\r\nThat's what I meant above", "meta": {"posReactions": "2", "negReactions": "0"}}
{"id": "COM5", "speaker": "KrillioSokolov", "conversation_id": "ROOT", "reply_to": "COM4", "timestamp": "2021-02-09T17:25:04Z", "text": "Unprofessional for Flutter team to have this issue for more than 1 year.\r\nIt is just shows up the whole Google company style - quantity over quality. \r\nCan't wait cross-platform solution from Apple. It will be just different, as always later than Google, but just perfectly usable.\r\n\r\nPLEASE PROVIDE SOLUTION to whole community ASAP or just put Flutter here https://killedbygoogle.com. ", "meta": {"posReactions": "5", "negReactions": "3"}}
{"id": "COM6", "speaker": "escamoteur", "conversation_id": "ROOT", "reply_to": "COM5", "timestamp": "2021-02-09T17:54:47Z", "text": "@KrillioSokolov may I remind you of the code of conduct of this repository which strongly encourages a kind behaviour?\r\nThis isn't an issue that is so easy to fix. Always keep in mind that this is a full framework you get for free.\r\nAnd this issue would be way easier if Apple hadn't decided not to join all other Vendors in Vulkan but to develop Metal.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM7", "speaker": "KrillioSokolov", "conversation_id": "ROOT", "reply_to": "COM6", "timestamp": "2021-02-09T18:28:11Z", "text": "@escamoteur, I am really sorry if I break any rules. I'm struggling about passive reaction of Flutter team. \r\n\r\nYes, you are right it's for free, except developers fee, right? We are paying commission in the Play Store, paying account fees and Google provides tools for making applications which will gain more money for Google. It's simple consumption chain. \r\n\r\nFor sure, me and many others developers feel deceived about this situation, because Flutter team PROMISED 60 fps animation! We all invest years of our lives in usage this technology, we spent our tech-reputation to push ours companies to take a risk and invest resources to achieve this technology. And what we have got from Flutter team? \r\n\r\nIndifference for the whole year! They decide to expand to the web and desktop, instead of contributing theirs main features and take care of community. That's why I tell, that \"quantity over quality\"\r\n\r\nAnd you are really think that is the Apple's problem? If you decide to create cross-platform system you had better to being ready for changes from each contributed platforms, a specially from a such moody company as Apple. \r\n", "meta": {"posReactions": "3", "negReactions": "0"}}
{"id": "COM8", "speaker": "aliakhtar", "conversation_id": "ROOT", "reply_to": "COM7", "timestamp": "2021-02-09T19:40:21Z", "text": "I'm grateful to the Flutter developers for their work on Flutter, and for making it available for free.\r\n\r\nA few points.\r\n\r\n- On the Flutter site, this issue is still not clearly shown. I spent a week of full time effort learning Flutter, only to find out about this issue hidden in the shader optimization article. I feel misled because everything I first saw on homepage etc, promised 60 FPS and native performance. I think its bordering on unethical to not make this problem clearly known to new developers.\r\n\r\n- This issue should be a higher priority than anything else, instead it still seems like its a P3 or lower. No one is even assigned to this issue yet?\r\n\r\n- There should be an ETA / timeline for a resolution.\r\n\r\nIt looks like there's a solution available - running animations in the background to warm up the shader. We just need something around that to be made official.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM9", "speaker": "omchiii", "conversation_id": "ROOT", "reply_to": "COM8", "timestamp": "2021-02-09T19:41:32Z", "text": "Flutter team itself said that they considered the option to go with OpenGL and Metal, but they didn’t. They decided to go with Metal only. What I don’t understand is how did they not see this issue when they were testing? I don’t believe switching over to Metal was a 3 minute decision.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM10", "speaker": "omchiii", "conversation_id": "ROOT", "reply_to": "COM9", "timestamp": "2021-02-09T19:48:41Z", "text": "> I'm grateful to all the Flutter developers for their work on Flutter, and for making it available for free.\r\n> \r\n> A few points.\r\n> \r\n> * On the Flutter site, this issue is still not clearly shown. I spent a week of full time effort learning Flutter, only to find out about this issue hidden in the shader optimization article. I feel misled because everything I first saw on homepage etc, promised 60 FPS and native performance. I think its bordering on unethical to not make this problem clearly known to new developers.\r\n> * This issue should be a higher priority than anything else, instead it still seems like its a P3 or lower. No one is even assigned to this issue yet?\r\n> * There should be an ETA / timeline for a resolution.\r\n> \r\n> It looks like there's a solution available - running animations in the background to warm up the shader. We just need something around that to be made official.\r\n\r\nTo be honest. Flutter being free in this case makes it only worse. I wish it was paid so we would not get the “it’s free, whatever you get be happy” response. At least we would not get a 100 line code commit after 1 year on such a huge issue.", "meta": {"posReactions": "7", "negReactions": "0"}}
{"id": "COM11", "speaker": "huvi8161", "conversation_id": "ROOT", "reply_to": "COM10", "timestamp": "2021-02-11T08:10:02Z", "text": "@chinmaygarde do you have any comments on the idea to cache and distribute MSL? Also is this an issue where you will track further progress on this issue? Do you have some kind of document or could you create one in which you would describe the setup to tray to debug this so maybe somebody also could get involved and maybe we could get more ideas? And the final question is are you the only person that is working on this?", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM12", "speaker": "dnfield", "conversation_id": "ROOT", "reply_to": "COM11", "timestamp": "2021-02-11T17:13:06Z", "text": "Chinmay and I talked about this a bit offline.\r\n\r\nCaching the MSL has a few challenges:\r\n\r\n- Apple doesn't seem to provide a good way to fetch the binary archives from the device/application for caching.\r\n- It still has many disadvantages, such as not necessarily knowing when you'd need to do this, whether your cached shaders are still valid or not, whether you're missing an important one, etc.\r\n\r\nWe're trying to come up with a more comprehensive solution for this - one that would clearly let developers know when their scene might be complex enough to result in lengthy shader compilation, and what options they have to mitigate that.", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM13", "speaker": "escamoteur", "conversation_id": "ROOT", "reply_to": "COM12", "timestamp": "2021-02-11T17:32:58Z", "text": "@dnfield from my understanding the shaders we are talking of don't get there source dynamically or are they? So you wouldn't even need to cache them you could directly bundle the precompiled metal shaders. In contrary to OpenGL you always know that the metal API will be there.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM14", "speaker": "KrillioSokolov", "conversation_id": "ROOT", "reply_to": "COM13", "timestamp": "2021-02-11T17:44:40Z", "text": "Anyone else has opinion that cashing is just a crutch? Looks like, it is just attempt to run away from the problem and try to hide it. \r\n\r\nGuys from Flutter team, you spend tone of time to learn algorithms, data structure, low level programming for get work in Google and for now is it actually that type of solution you wanna provide being hired by the one of the best company in the world? Crutch? \r\n\r\nAll application on flutter just lagging, even Google applications, everyone understand that cashing would probably decrease lagging, but not remove them all. When you solve this issue(instead of provide workaround) Flutter will be best SaaS decision in the world, even for iOS users! \r\n\r\n Believe in you guys.", "meta": {"posReactions": "0", "negReactions": "2"}}
{"id": "COM15", "speaker": "escamoteur", "conversation_id": "ROOT", "reply_to": "COM14", "timestamp": "2021-02-11T17:48:56Z", "text": "> \r\n> \r\n> Anyone else has opinion that cashing is just a crutch? Looks like, it is just attempt to run away from the problem and try to hide it.\r\n> \r\n> Guys from Flutter team, you spend tone of time to learn algorithms, data structure, low level programming for working in Google and for now is it actually that type of solution you wanna provide in one of the hugest company in the world? Crutch? All application on flutter just lagging, even Google applications, everyone understand that cashing would probably decrease lagging, but not remove them all.\r\n\r\nI recommend diving a bit deeper in the world of shaders an crossplatform GPU programming before making such a statement. Shaders have to be compiled before you can use them the first time. There is no way around it. So caching the compiled shaders is the usual way you do this.  My guess is that iOS native Apps use shaders that are already loaded by the operating system.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM16", "speaker": "KrillioSokolov", "conversation_id": "ROOT", "reply_to": "COM15", "timestamp": "2021-02-11T17:55:34Z", "text": "@escamoteur, hm...  Will increasing a duration of showing Launch Screen give enough time to launch engine and load shaders to use it? \r\n", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM17", "speaker": "escamoteur", "conversation_id": "ROOT", "reply_to": "COM16", "timestamp": "2021-02-11T17:59:32Z", "text": "@KrillioSokolov from my understanding Flutter only creates the shaders when it needs them the first time, which makes sense because why create shaders for widgets you never use.\r\nMy guess is if you create the widgets where you encounter the jank already behind your Startup screen, that could help, but I' not sure if shaders will be created if the widgets are hidden.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM18", "speaker": "acoutts", "conversation_id": "ROOT", "reply_to": "COM17", "timestamp": "2021-02-11T18:00:47Z", "text": "> @escamoteur, hm... Will increasing a duration of showing Launch Screen give enough time to launch engine and load shaders to use it?\r\n\r\nThe problem with this approach is you can't do it with a screen transition. I tried this even putting a hidden navigator behind the current screen with a stack and pushing/popping 3-5 times behind a loading screen, and it had no impact on the perceived jank after that.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM19", "speaker": "dnfield", "conversation_id": "ROOT", "reply_to": "COM18", "timestamp": "2021-02-11T18:02:42Z", "text": "I think we're starting to get a bit off topic here.\r\n\r\nVery briefly, the need for shader compilation has to do with Flutter allowing you to dynamically create lots of different pixel configurations on the GPU. In theory, one could try to write a lot of that logic itself as a shader program, compile that \"uber shader\" once, and then never suffer from shader compilation jank during application run. In practice, that's extremely difficult to do correctly and may not even be possible to do performantly - shaders want to be small, well defined programs typically, and supporting everything that Flutter can do with such a program (on all the GPUs we have to support) is a very large problem space. Caching smaller programs can help, but it is not an ideal solution since different GPU/OS/driver versions can cause cache misses. This could be a problem even on iOS, where different phone/iPad models and iOS versions are in use. There are other design possibilities being considered as well.\r\n\r\nAs I said, we're working to come up with an overall better solution for this, but it's not an easy problem to deal with. This is considered an important issue by the team. We welcome contributions here as well, whether it's a patch or design proposals/feedback.", "meta": {"posReactions": "1", "negReactions": "0"}}
{"id": "COM20", "speaker": "escamoteur", "conversation_id": "ROOT", "reply_to": "COM19", "timestamp": "2021-02-11T18:02:58Z", "text": "> \r\n> \r\n> > @escamoteur, hm... Will increasing a duration of showing Launch Screen give enough time to launch engine and load shaders to use it?\r\n> \r\n> The problem with this approach is you can't do it with a screen transition. I tried this even putting a hidden navigator behind the current screen with a stack and pushing/popping 3-5 times behind a loading screen, and it had no impact on the perceived jank after that.\r\n\r\nYeah, I was already fearing the the engine is too \"smart\" not to create any shader unless it really has to use it.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM21", "speaker": "dnfield", "conversation_id": "ROOT", "reply_to": "COM20", "timestamp": "2021-02-11T18:07:56Z", "text": "@acoutts - I wonder if you'd have better luck with that solution by actually rasterizing frames from that animation to a pixel buffer. Putting it somewhere invisible may get optimized away.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM22", "speaker": "acoutts", "conversation_id": "ROOT", "reply_to": "COM21", "timestamp": "2021-02-11T18:08:47Z", "text": "> @acoutts - I wonder if you'd have better luck with that solution by actually rasterizing frames from that animation to a pixel buffer. Putting it somewhere invisible may get optimized away.\r\n\r\nI'd love to give it a shot. Have any docs I can read up on for how to do this kind of thing?", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM23", "speaker": "dnfield", "conversation_id": "ROOT", "reply_to": "COM22", "timestamp": "2021-02-11T18:09:08Z", "text": "I'll also mention: sometimes the solution is just to do something less expensive. See for example https://github.com/flutter/flutter/pull/75670 - we found that using `drawRect` calls instead of a `LinearGradient` saves significant amount of time on initial rendering time.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM24", "speaker": "dnfield", "conversation_id": "ROOT", "reply_to": "COM23", "timestamp": "2021-02-11T21:34:03Z", "text": "@acoutts - not really. I'd try to just experiment with rendering the widget into a repaint boundary and using https://api.flutter.dev/flutter/rendering/RenderRepaintBoundary/toImage.html to render it into a small image as part of a warmup routine, or https://api.flutter.dev/flutter/rendering/OffsetLayer/toImage.html if that makes more sense.\r\n\r\nYou might also try just directly using the `SceneBuilder` API and using `Scene.toImage` depending on how you approach it.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM25", "speaker": "huvi8161", "conversation_id": "ROOT", "reply_to": "COM24", "timestamp": "2021-02-11T21:53:49Z", "text": "@dnfield If I understand you well we should try to convert our page ui(scene) into an image and than try to paint it inside Flutter default warmup routine (https://api.flutter.dev/flutter/painting/DefaultShaderWarmUp-class.html) am I correct in this assumption? Also for us the main issue is the the cupertino route page transition we have other animations but nothing is as important as the first few page transitions and they have issue with shader compilation, page transition shader is directly related with the content of this page, we should try to get the images of pages that user is going to see first and put them in warmup routine? Can you just confirm or deny my assumptions?  ", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM26", "speaker": "dnfield", "conversation_id": "ROOT", "reply_to": "COM25", "timestamp": "2021-02-11T21:55:00Z", "text": "You don't want to save the image - you want to get Skia to create the shader(s) needed to create the image.\r\n\r\nI'm not necessarily recommending this approach, but I think it's one that might be worth experimenting with and see what we can get out of it.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM27", "speaker": "dnfield", "conversation_id": "ROOT", "reply_to": "COM26", "timestamp": "2021-02-11T21:55:38Z", "text": "IOW, you want to try to capture relevant frame(s) from your actual widgets/transitions, and rasterize them so that the needed shader(s) get compiled up front.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM28", "speaker": "huvi8161", "conversation_id": "ROOT", "reply_to": "COM27", "timestamp": "2021-02-11T22:00:52Z", "text": "Does it make sense to put that widget in a stack below the content of login page, this way it is not going to be visible to the user, but is Fluttter going to send that widget to GPU to create shader since it is not visible(it is in stack below some other content)?", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM29", "speaker": "dnfield", "conversation_id": "ROOT", "reply_to": "COM28", "timestamp": "2021-02-11T22:02:02Z", "text": "I think you'd probably want to do this during a splash screen or at least during some other idle time in the app. Exactly when is hard to say. We'd want to see that such a method is workable too though  first :)", "meta": {"posReactions": "0", "negReactions": "0"}}
