{"id": "ROOT", "speaker": "Gibson85", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2018-06-16T20:13:42Z", "text": "Are you serious? Sorry to say, that I am totally pissed off from this worst programmed piece of software/plugin I have ever seen. With every new version something else is not working anymore. I shouldn't complain about software I had nothing to pay for, but have you ever heard something about quality management? You are releasing a version 1.0.0 that is simply not working. How couldn't this be seen? Then a few days later a \"fixed\" version 1.0.1 still not working. And the same with the versions in the past. Fatal errors over errors again. If you have no linux pc please install yourself a virtual machine and have at least a try before releasing such an sh... It's an effort from < 1 hour.\r \r PLEASE improve your testing in future. Thanks.\r \r Debian Stretch 9.4\r cmake version 3.11.3\r \r [fatal] [rollbar] Unhandled exception: Unhandled Promise rejection: build Error: spawn /usr/local/bin/ctest ENOENT {}\r t.log @ /usr/share/code/resources/app/out/vs/workbench/workbench.main.js:268\r /usr/share/code/resources/app/out/vs/workbench/workbench.main.js:268 [Extension Host] Error: spawn /usr/local/bin/ctest ENOENT\r \tat exports._errnoException (util.js:1050:11)\r \tat Process.ChildProcess._handle.onexit (internal/child_process.js:193:32)\r \tat onErrorNT (internal/child_process.js:367:16)\r \tat _combinedTickCallback (internal/process/next_tick.js:80:11)\r \tat process._tickCallback (internal/process/next_tick.js:104:9)\r t.log @ /usr/share/code/resources/app/out/vs/workbench/workbench.main.js:268", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM0", "speaker": "Randshot", "conversation_id": "ROOT", "reply_to": "ROOT", "timestamp": "2018-06-16T21:23:16Z", "text": "@Gibson85 Have you looked up what `spawn * ENOENT` means?\r\nIt means that it couldn't find the command/executable in question, so this doesn't really have anything to do with the extension itself.\r\nYou could argue that unhelpful error messages are a kind of bug, but that is another issue.\r\n\r\nSo, instead of ranting here, maybe you should try to find the cause of the problem and/or open a PR that fixes this kind of issue, if necessary.\r\nI don't have anything against bug reports, but the above is really sad...", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM1", "speaker": "neilogd", "conversation_id": "ROOT", "reply_to": "COM0", "timestamp": "2018-06-16T23:02:32Z", "text": "\"Sorry to say, that I am totally pissed off from this worst programmed piece of software/plugin I have ever seen.\"\r\n\r\nThis seems unnecessarily hostile, especially given that, in your own words, - \"I shouldn't complain about software I had nothing to pay for\"\r\n\r\nHave you considered simply reporting the issue, without any of the assholery? Ultimately if you do think it is the \"worst programmed piece of software\", you do have other options. Can write your own, can use something else, or, now this is my preferred approach generally, to help the maintainer improve it without being a douche.", "meta": {"posReactions": "0", "negReactions": "0"}}
{"id": "COM2", "speaker": "vector-of-bool", "conversation_id": "ROOT", "reply_to": "COM1", "timestamp": "2018-06-16T23:16:07Z", "text": "> I shouldn't complain about software I had nothing to pay for\r\n\r\nThen don't?\r\n\r\nI develop almost always using a Linux environment. It's *Windows* and *macOS* that receive the most bugs.\r\n\r\nI take pride in my work, even if I only do this in my free time for no payment.\r\n\r\nThe 1.0.0 release was mostly a two-person effort and focused on code health. The 1.0.1 saw only fixes that were pending 1.0.1 since 1.0.0 was hugely behind schedule. I experienced hardware failures that prevented me from working for nearly two weeks. Almost no bugs that were introduced by 1.0.0 were addressed, and I was pleasantly surprised by the lack of an influx of bug reports following 1.0.0 and 1.0.1.\r\n\r\nI feel personally responsible for almost every bug that anyone opens in this issue tracker, and I strive to keep the issue count low and under control.\r\n\r\nI do not feel so keen on this ticket.\r\n\r\nIssue #428 is similar, but I closed it because I believed I had fixed it. That issue was opened by a collaborator, not a general user.\r\n\r\nI have received no automated error reports with a traceback resembling yours. I address issues based on how frequently they appear in my Rollbar account, or how frequently people react using GitHub issue tracker. No one other than a collaborator has ever reported seeing this problem.\r\n\r\nI'm going to close this and lock the conversation.\r\n\r\nIf you would like to re-open another GitHub issue calmly describing your problem with less vitriol and toxicity, I will gladly add it to my next release milestone, I'll add a test case for the situation, and I'll forget that this exchange happened.", "meta": {"posReactions": "0", "negReactions": "0"}}
